<?xml version="1.0"?>
<net name="main_graph" version="11">
	<layers>
		<layer id="1" name="image_embeddings" type="Parameter" version="opset1">
			<data shape="1,256,64,64" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="image_embeddings">
					<dim>1</dim>
					<dim>256</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="0" name="boxes" type="Parameter" version="opset1">
			<data shape="1,4" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="boxes">
					<dim>1</dim>
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="Constant_4837" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 256" offset="0" size="1024" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="Constant_4833" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 256" offset="1024" size="1024" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="/mask_decoder/Expand_output_0" type="Const" version="opset1">
			<data element_type="f32" shape="1, 5, 256" offset="2048" size="5120" />
			<output>
				<port id="0" precision="FP32" names="/mask_decoder/Expand_output_0">
					<dim>1</dim>
					<dim>5</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="Constant_4827" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1" offset="7168" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="/prompt_encoder/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>4</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/prompt_encoder/Add_output_0">
					<dim>1</dim>
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="/prompt_encoder/Constant_3_output_0" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="7172" size="24" />
			<output>
				<port id="0" precision="I64" names="/prompt_encoder/Constant_3_output_0">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="/prompt_encoder/Reshape" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>4</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/prompt_encoder/Reshape_output_0">
					<dim>1</dim>
					<dim>2</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="/prompt_encoder/Concat_output_0" type="Const" version="opset1">
			<data element_type="i64" shape="1, 2, 1, 3" offset="7196" size="48" />
			<output>
				<port id="0" precision="I64" names="/prompt_encoder/Concat_output_0">
					<dim>1</dim>
					<dim>2</dim>
					<dim>1</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="/prompt_encoder/Constant_output_0" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="7244" size="8" />
			<output>
				<port id="0" precision="I64" names="/prompt_encoder/Constant_output_0" />
			</output>
		</layer>
		<layer id="11" name="Constant_156" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="7252" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="12" name="/prompt_encoder/Gather" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>2</dim>
					<dim>2</dim>
				</port>
				<port id="1" precision="I64" />
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="FP32" names="/prompt_encoder/Gather_output_0">
					<dim>1</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="Constant_4828" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1" offset="7260" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="/prompt_encoder/Div" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>2</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/prompt_encoder/Div_output_0">
					<dim>1</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="/prompt_encoder/Constant_6_output_0" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="7264" size="24" />
			<output>
				<port id="0" precision="I64" names="/prompt_encoder/Constant_6_output_0">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="/prompt_encoder/Reshape_1" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>2</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/prompt_encoder/Reshape_1_output_0">
					<dim>1</dim>
					<dim>2</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="/prompt_encoder/ScatterND" type="ScatterNDUpdate" version="opset4">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>2</dim>
					<dim>2</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
					<dim>2</dim>
					<dim>1</dim>
					<dim>3</dim>
				</port>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>2</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="FP32" names="/prompt_encoder/ScatterND_output_0">
					<dim>1</dim>
					<dim>2</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="/prompt_encoder/Concat_2_output_0" type="Const" version="opset1">
			<data element_type="i64" shape="1, 2, 1, 3" offset="7288" size="48" />
			<output>
				<port id="0" precision="I64" names="/prompt_encoder/Concat_2_output_0">
					<dim>1</dim>
					<dim>2</dim>
					<dim>1</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="/prompt_encoder/Constant_1_output_0" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="7336" size="8" />
			<output>
				<port id="0" precision="I64" names="/prompt_encoder/Constant_1_output_0" />
			</output>
		</layer>
		<layer id="20" name="Constant_161" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="7252" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="21" name="/prompt_encoder/Gather_2" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>2</dim>
					<dim>2</dim>
				</port>
				<port id="1" precision="I64" />
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="FP32" names="/prompt_encoder/Gather_2_output_0">
					<dim>1</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="Constant_4829" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1" offset="7260" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="/prompt_encoder/Div_1" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>2</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/prompt_encoder/Div_1_output_0">
					<dim>1</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="/prompt_encoder/Reshape_2" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>2</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/prompt_encoder/Reshape_2_output_0">
					<dim>1</dim>
					<dim>2</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="/prompt_encoder/ScatterND_1" type="ScatterNDUpdate" version="opset4">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>2</dim>
					<dim>2</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
					<dim>2</dim>
					<dim>1</dim>
					<dim>3</dim>
				</port>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>2</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="FP32" names="/prompt_encoder/ScatterND_1_output_0">
					<dim>1</dim>
					<dim>2</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="Constant_4830" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1" offset="7344" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="/prompt_encoder/Mul_6" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>2</dim>
					<dim>2</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/prompt_encoder/Mul_6_output_0">
					<dim>1</dim>
					<dim>2</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="Constant_4831" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1" offset="7348" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="/prompt_encoder/Sub" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>2</dim>
					<dim>2</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/prompt_encoder/Sub_output_0">
					<dim>1</dim>
					<dim>2</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="Transpose_3238" type="Const" version="opset1">
			<data element_type="f32" shape="128, 2" offset="7352" size="1024" />
			<output>
				<port id="0" precision="FP32">
					<dim>128</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="/prompt_encoder/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>2</dim>
					<dim>2</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>128</dim>
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/prompt_encoder/MatMul_output_0">
					<dim>1</dim>
					<dim>2</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="Constant_4832" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1" offset="8376" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="/prompt_encoder/Mul_7" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>2</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/prompt_encoder/Mul_7_output_0">
					<dim>1</dim>
					<dim>2</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="/prompt_encoder/Sin" type="Sin" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>2</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/prompt_encoder/Sin_output_0">
					<dim>1</dim>
					<dim>2</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="/prompt_encoder/Cos" type="Cos" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>2</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/prompt_encoder/Cos_output_0">
					<dim>1</dim>
					<dim>2</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="/prompt_encoder/Concat_4" type="Concat" version="opset1">
			<data axis="-1" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>2</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>2</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/prompt_encoder/Concat_4_output_0">
					<dim>1</dim>
					<dim>2</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="/prompt_encoder/Concat_5_output_0" type="Const" version="opset1">
			<data element_type="i64" shape="1, 1, 256, 3" offset="8380" size="6144" />
			<output>
				<port id="0" precision="I64" names="/prompt_encoder/Concat_5_output_0">
					<dim>1</dim>
					<dim>1</dim>
					<dim>256</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="Constant_173" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="7336" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="39" name="/prompt_encoder/Gather_4" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>2</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="I64" />
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="FP32" names="/prompt_encoder/Gather_4_output_0">
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="prompt_encoder.point_embeddings.2.weight" type="Const" version="opset1">
			<data element_type="f32" shape="1, 256" offset="14524" size="1024" />
			<output>
				<port id="0" precision="FP32" names="prompt_encoder.point_embeddings.2.weight">
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="/prompt_encoder/Add_1" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/prompt_encoder/Add_1_output_0">
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="/prompt_encoder/Constant_36_output_0" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="15548" size="24" />
			<output>
				<port id="0" precision="I64" names="/prompt_encoder/Constant_36_output_0">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="/prompt_encoder/Reshape_3" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/prompt_encoder/Reshape_3_output_0">
					<dim>1</dim>
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="/prompt_encoder/ScatterND_2" type="ScatterNDUpdate" version="opset4">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>2</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
					<dim>1</dim>
					<dim>256</dim>
					<dim>3</dim>
				</port>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="FP32" names="/prompt_encoder/ScatterND_2_output_0">
					<dim>1</dim>
					<dim>2</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="/prompt_encoder/ScatterND_3" type="ScatterNDUpdate" version="opset4">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>2</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
					<dim>1</dim>
					<dim>256</dim>
					<dim>3</dim>
				</port>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="FP32" names="/prompt_encoder/ScatterND_3_output_0">
					<dim>1</dim>
					<dim>2</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="/prompt_encoder/Concat_9_output_0" type="Const" version="opset1">
			<data element_type="i64" shape="1, 1, 256, 3" offset="15572" size="6144" />
			<output>
				<port id="0" precision="I64" names="/prompt_encoder/Concat_9_output_0">
					<dim>1</dim>
					<dim>1</dim>
					<dim>256</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="Constant_179" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="7336" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="48" name="/prompt_encoder/Gather_6" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>2</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="I64" />
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="FP32" names="/prompt_encoder/Gather_6_output_0">
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="prompt_encoder.point_embeddings.3.weight" type="Const" version="opset1">
			<data element_type="f32" shape="1, 256" offset="21716" size="1024" />
			<output>
				<port id="0" precision="FP32" names="prompt_encoder.point_embeddings.3.weight">
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="/prompt_encoder/Add_2" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/prompt_encoder/Add_2_output_0">
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="/prompt_encoder/Reshape_5" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/prompt_encoder/Reshape_5_output_0">
					<dim>1</dim>
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="/prompt_encoder/ScatterND_4" type="ScatterNDUpdate" version="opset4">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>2</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
					<dim>1</dim>
					<dim>256</dim>
					<dim>3</dim>
				</port>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="FP32" names="/prompt_encoder/ScatterND_4_output_0">
					<dim>1</dim>
					<dim>2</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="/prompt_encoder/ScatterND_5" type="ScatterNDUpdate" version="opset4">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>2</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
					<dim>1</dim>
					<dim>256</dim>
					<dim>3</dim>
				</port>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="FP32" names="/prompt_encoder/ScatterND_5_output_0">
					<dim>1</dim>
					<dim>2</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="/mask_decoder/Concat" type="Concat" version="opset1">
			<data axis="1" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>5</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>2</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/mask_decoder/Concat_output_0">
					<dim>1</dim>
					<dim>7</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="Transpose_3299" type="Const" version="opset1">
			<data element_type="f32" shape="256, 256" offset="22740" size="262144" />
			<output>
				<port id="0" precision="FP32">
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="/mask_decoder/transformer/layers.0/self_attn/q_proj/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>7</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/mask_decoder/transformer/layers.0/self_attn/q_proj/MatMul_output_0">
					<dim>1</dim>
					<dim>7</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="/mask_decoder/transformer/layers.0/self_attn/q_proj/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>7</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/mask_decoder/transformer/layers.0/self_attn/q_proj/Add_output_0">
					<dim>1</dim>
					<dim>7</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="/mask_decoder/transformer/layers.0/self_attn/Constant_output_0" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="284884" size="32" />
			<output>
				<port id="0" precision="I64" names="/mask_decoder/transformer/layers.0/self_attn/Constant_output_0">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="/mask_decoder/transformer/layers.0/self_attn/Reshape" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>7</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/mask_decoder/transformer/layers.0/self_attn/Reshape_output_0">
					<dim>1</dim>
					<dim>7</dim>
					<dim>8</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="Constant_197" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="284916" size="32" />
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="/mask_decoder/transformer/layers.0/self_attn/Transpose" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>7</dim>
					<dim>8</dim>
					<dim>32</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/mask_decoder/transformer/layers.0/self_attn/Transpose_output_0">
					<dim>1</dim>
					<dim>8</dim>
					<dim>7</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="Constant_4834" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 256" offset="284948" size="1024" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="Transpose_3324" type="Const" version="opset1">
			<data element_type="f32" shape="256, 256" offset="285972" size="262144" />
			<output>
				<port id="0" precision="FP32">
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="/mask_decoder/transformer/layers.0/self_attn/k_proj/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>7</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/mask_decoder/transformer/layers.0/self_attn/k_proj/MatMul_output_0">
					<dim>1</dim>
					<dim>7</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="/mask_decoder/transformer/layers.0/self_attn/k_proj/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>7</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/mask_decoder/transformer/layers.0/self_attn/k_proj/Add_output_0">
					<dim>1</dim>
					<dim>7</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="/mask_decoder/transformer/layers.0/self_attn/Reshape_1" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>7</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/mask_decoder/transformer/layers.0/self_attn/Reshape_1_output_0">
					<dim>1</dim>
					<dim>7</dim>
					<dim>8</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="Constant_203" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="548116" size="32" />
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="/mask_decoder/transformer/layers.0/self_attn/Transpose_2" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>7</dim>
					<dim>8</dim>
					<dim>32</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/mask_decoder/transformer/layers.0/self_attn/Transpose_2_output_0">
					<dim>1</dim>
					<dim>8</dim>
					<dim>32</dim>
					<dim>7</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="/mask_decoder/transformer/layers.0/self_attn/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="false" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>7</dim>
					<dim>32</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>32</dim>
					<dim>7</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/mask_decoder/transformer/layers.0/self_attn/MatMul_output_0">
					<dim>1</dim>
					<dim>8</dim>
					<dim>7</dim>
					<dim>7</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="Constant_4835" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1, 1" offset="548148" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="/mask_decoder/transformer/layers.0/self_attn/Div" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>7</dim>
					<dim>7</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/mask_decoder/transformer/layers.0/self_attn/Div_output_0">
					<dim>1</dim>
					<dim>8</dim>
					<dim>7</dim>
					<dim>7</dim>
				</port>
			</output>
		</layer>
		<layer id="72" name="/mask_decoder/transformer/layers.0/self_attn/Softmax" type="SoftMax" version="opset8">
			<data axis="-1" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>7</dim>
					<dim>7</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/mask_decoder/transformer/layers.0/self_attn/Softmax_output_0">
					<dim>1</dim>
					<dim>8</dim>
					<dim>7</dim>
					<dim>7</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="Constant_4836" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 256" offset="548152" size="1024" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="Transpose_3359" type="Const" version="opset1">
			<data element_type="f32" shape="256, 256" offset="549176" size="262144" />
			<output>
				<port id="0" precision="FP32">
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="/mask_decoder/transformer/layers.0/self_attn/v_proj/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>7</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/mask_decoder/transformer/layers.0/self_attn/v_proj/MatMul_output_0">
					<dim>1</dim>
					<dim>7</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="/mask_decoder/transformer/layers.0/self_attn/v_proj/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>7</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/mask_decoder/transformer/layers.0/self_attn/v_proj/Add_output_0">
					<dim>1</dim>
					<dim>7</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="/mask_decoder/transformer/layers.0/self_attn/Reshape_2" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>7</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/mask_decoder/transformer/layers.0/self_attn/Reshape_2_output_0">
					<dim>1</dim>
					<dim>7</dim>
					<dim>8</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="78" name="Constant_201" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="284916" size="32" />
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="/mask_decoder/transformer/layers.0/self_attn/Transpose_1" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>7</dim>
					<dim>8</dim>
					<dim>32</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/mask_decoder/transformer/layers.0/self_attn/Transpose_1_output_0">
					<dim>1</dim>
					<dim>8</dim>
					<dim>7</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="/mask_decoder/transformer/layers.0/self_attn/MatMul_1" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="false" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>7</dim>
					<dim>7</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>7</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/mask_decoder/transformer/layers.0/self_attn/MatMul_1_output_0">
					<dim>1</dim>
					<dim>8</dim>
					<dim>7</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="81" name="Constant_209" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="284916" size="32" />
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="82" name="/mask_decoder/transformer/layers.0/self_attn/Transpose_3" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>7</dim>
					<dim>32</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/mask_decoder/transformer/layers.0/self_attn/Transpose_3_output_0">
					<dim>1</dim>
					<dim>7</dim>
					<dim>8</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="83" name="/mask_decoder/transformer/layers.0/self_attn/Constant_4_output_0" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="811320" size="24" />
			<output>
				<port id="0" precision="I64" names="/mask_decoder/transformer/layers.0/self_attn/Constant_4_output_0">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="84" name="/mask_decoder/transformer/layers.0/self_attn/Reshape_3" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>7</dim>
					<dim>8</dim>
					<dim>32</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/mask_decoder/transformer/layers.0/self_attn/Reshape_3_output_0">
					<dim>1</dim>
					<dim>7</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="85" name="Transpose_3410" type="Const" version="opset1">
			<data element_type="f32" shape="256, 256" offset="811344" size="262144" />
			<output>
				<port id="0" precision="FP32">
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="86" name="/mask_decoder/transformer/layers.0/self_attn/out_proj/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>7</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/mask_decoder/transformer/layers.0/self_attn/out_proj/MatMul_output_0">
					<dim>1</dim>
					<dim>7</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="87" name="/mask_decoder/transformer/layers.0/self_attn/out_proj/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>7</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/mask_decoder/transformer/layers.0/self_attn/out_proj/Add_output_0">
					<dim>1</dim>
					<dim>7</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="88" name="Range_217" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="1073488" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="89" name="MVN_218" type="MVN" version="opset6">
			<data eps="9.9999997473787516e-06" normalize_variance="true" eps_mode="INSIDE_SQRT" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>7</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>7</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="90" name="Constant_4838" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 256" offset="1073496" size="1024" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="91" name="Multiply_219" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>7</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>7</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="92" name="Constant_4839" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 256" offset="1074520" size="1024" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="93" name="/mask_decoder/transformer/layers.0/norm1/LayerNormalization" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>7</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/mask_decoder/transformer/layers.0/norm1/LayerNormalization_output_0">
					<dim>1</dim>
					<dim>7</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="94" name="Constant_4844" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 256" offset="1075544" size="1024" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="95" name="Constant_4840" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 128" offset="1076568" size="512" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="96" name="/mask_decoder/transformer/layers.0/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>7</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>7</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/mask_decoder/transformer/layers.0/Add_output_0">
					<dim>1</dim>
					<dim>7</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="97" name="Transpose_3449" type="Const" version="opset1">
			<data element_type="f32" shape="128, 256" offset="1077080" size="131072" />
			<output>
				<port id="0" precision="FP32">
					<dim>128</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="98" name="/mask_decoder/transformer/layers.0/cross_attn_token_to_image/q_proj/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>7</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>128</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/mask_decoder/transformer/layers.0/cross_attn_token_to_image/q_proj/MatMul_output_0">
					<dim>1</dim>
					<dim>7</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="99" name="/mask_decoder/transformer/layers.0/cross_attn_token_to_image/q_proj/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>7</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/mask_decoder/transformer/layers.0/cross_attn_token_to_image/q_proj/Add_output_0">
					<dim>1</dim>
					<dim>7</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="100" name="/mask_decoder/transformer/layers.0/cross_attn_token_to_image/Constant_output_0" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="1208152" size="32" />
			<output>
				<port id="0" precision="I64" names="/mask_decoder/transformer/layers.0/cross_attn_token_to_image/Constant_output_0">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="101" name="/mask_decoder/transformer/layers.0/cross_attn_token_to_image/Reshape" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>7</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/mask_decoder/transformer/layers.0/cross_attn_token_to_image/Reshape_output_0">
					<dim>1</dim>
					<dim>7</dim>
					<dim>8</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="102" name="Constant_230" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="284916" size="32" />
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="103" name="/mask_decoder/transformer/layers.0/cross_attn_token_to_image/Transpose" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>7</dim>
					<dim>8</dim>
					<dim>16</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/mask_decoder/transformer/layers.0/cross_attn_token_to_image/Transpose_output_0">
					<dim>1</dim>
					<dim>8</dim>
					<dim>7</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="104" name="Constant_4841" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 128" offset="1208184" size="512" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="105" name="/prompt_encoder/Expand_24_output_0" type="Const" version="opset1">
			<data element_type="f32" shape="1, 256, 64, 64" offset="1208696" size="4194304" />
			<output>
				<port id="0" precision="FP32" names="/prompt_encoder/Expand_24_output_0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="106" name="/mask_decoder/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/mask_decoder/Add_output_0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="107" name="_v_423" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="5403000" size="24" />
			<output>
				<port id="0" precision="I64" names="_v_423">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="108" name="/mask_decoder/transformer/Reshape" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/mask_decoder/transformer/Reshape_output_0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>4096</dim>
				</port>
			</output>
		</layer>
		<layer id="109" name="Constant_188" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="5403024" size="24" />
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="110" name="/mask_decoder/transformer/Transpose" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>4096</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/mask_decoder/transformer/Transpose_output_0">
					<dim>1</dim>
					<dim>4096</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="111" name="/mask_decoder/transformer/Transpose_1_output_0" type="Const" version="opset1">
			<data element_type="f32" shape="1, 4096, 256" offset="5403048" size="4194304" />
			<output>
				<port id="0" precision="FP32" names="/mask_decoder/transformer/Transpose_1_output_0">
					<dim>1</dim>
					<dim>4096</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="112" name="/mask_decoder/transformer/layers.0/Add_1" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>4096</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>4096</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/mask_decoder/transformer/layers.0/Add_1_output_0">
					<dim>1</dim>
					<dim>4096</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="113" name="Transpose_3494" type="Const" version="opset1">
			<data element_type="f32" shape="128, 256" offset="9597352" size="131072" />
			<output>
				<port id="0" precision="FP32">
					<dim>128</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="114" name="/mask_decoder/transformer/layers.0/cross_attn_token_to_image/k_proj/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>4096</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>128</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/mask_decoder/transformer/layers.0/cross_attn_token_to_image/k_proj/MatMul_output_0">
					<dim>1</dim>
					<dim>4096</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="115" name="/mask_decoder/transformer/layers.0/cross_attn_token_to_image/k_proj/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>4096</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/mask_decoder/transformer/layers.0/cross_attn_token_to_image/k_proj/Add_output_0">
					<dim>1</dim>
					<dim>4096</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="116" name="/mask_decoder/transformer/layers.0/cross_attn_token_to_image/Constant_1_output_0" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="9728424" size="32" />
			<output>
				<port id="0" precision="I64" names="/mask_decoder/transformer/layers.0/cross_attn_token_to_image/Constant_1_output_0">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="117" name="/mask_decoder/transformer/layers.0/cross_attn_token_to_image/Reshape_1" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>4096</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/mask_decoder/transformer/layers.0/cross_attn_token_to_image/Reshape_1_output_0">
					<dim>1</dim>
					<dim>4096</dim>
					<dim>8</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
