<?xml version="1.0"?>
<net name="main_graph" version="11">
	<layers>
		<layer id="1" name="image_embeddings" type="Parameter" version="opset1">
			<data shape="1,256,64,64" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="image_embeddings">
					<dim>1</dim>
					<dim>256</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="0" name="boxes" type="Parameter" version="opset1">
			<data shape="4" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="boxes">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="Constant_19732" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 256" offset="0" size="1024" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="Constant_19728" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 256" offset="1024" size="1024" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="/mask_decoder/Expand" type="Const" version="opset1">
			<data element_type="f32" shape="1, 5, 256" offset="2048" size="5120" />
			<output>
				<port id="0" precision="FP32" names="/mask_decoder/Expand_output_0">
					<dim>1</dim>
					<dim>5</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="/Constant" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="7168" size="24" />
			<output>
				<port id="0" precision="I64" names="/Constant_output_0">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="/Reshape" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>4</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/Reshape_output_0">
					<dim>1</dim>
					<dim>2</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="Constant_19726" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1" offset="7192" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="/Mul" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>2</dim>
					<dim>2</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/Mul_output_0">
					<dim>1</dim>
					<dim>2</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="Constant_19727" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1" offset="7196" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="/Sub" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>2</dim>
					<dim>2</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/Sub_output_0">
					<dim>1</dim>
					<dim>2</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="Multiply_19608" type="Const" version="opset1">
			<data element_type="f32" shape="128, 2" offset="7200" size="1024" />
			<output>
				<port id="0" precision="FP32">
					<dim>128</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="/Mul_1" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>2</dim>
					<dim>2</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>128</dim>
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/Mul_1_output_0">
					<dim>1</dim>
					<dim>2</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="/Sin" type="Sin" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>2</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/Sin_output_0">
					<dim>1</dim>
					<dim>2</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="/Cos" type="Cos" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>2</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/Cos_output_0">
					<dim>1</dim>
					<dim>2</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="/Concat" type="Concat" version="opset1">
			<data axis="-1" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>2</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>2</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/Concat_output_0">
					<dim>1</dim>
					<dim>2</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="/Concat_1" type="Const" version="opset1">
			<data element_type="i64" shape="1, 1, 256, 3" offset="8224" size="6144" />
			<output>
				<port id="0" precision="I64" names="/Concat_1_output_0">
					<dim>1</dim>
					<dim>1</dim>
					<dim>256</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="/Constant_5" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="14368" size="8" />
			<output>
				<port id="0" precision="I64" names="/Constant_5_output_0" />
			</output>
		</layer>
		<layer id="18" name="Constant_15505" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="14376" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="19" name="/Gather" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>2</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="I64" />
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="FP32" names="/Gather_output_0">
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="prompt_encoder.point_embeddings.2.weight" type="Const" version="opset1">
			<data element_type="f32" shape="1, 256" offset="14384" size="1024" />
			<output>
				<port id="0" precision="FP32" names="prompt_encoder.point_embeddings.2.weight">
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/Add_output_0">
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="ShapeOf_19151" type="ShapeOf" version="opset3">
			<data output_type="i64" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>2</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="Constant_19152" type="Const" version="opset1">
			<data element_type="i64" shape="2" offset="15408" size="16" />
			<output>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="Constant_19150" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="14368" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="25" name="/Shape" type="Gather" version="opset1">
			<input>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="I64" names="/Shape_2_output_0,/Shape_4_output_0,/Shape_6_output_0,/Shape_output_0">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="/Expand" type="Broadcast" version="opset3">
			<data mode="bidirectional" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/Expand_4_output_0,/Expand_output_0">
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="/Concat_2" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="15424" size="24" />
			<output>
				<port id="0" precision="I64" names="/Concat_2_output_0">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="/Reshape_1" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/Reshape_1_output_0,/Reshape_2_output_0">
					<dim>1</dim>
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="/ScatterND" type="ScatterNDUpdate" version="opset4">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>2</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
					<dim>1</dim>
					<dim>256</dim>
					<dim>3</dim>
				</port>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="FP32" names="/ScatterND_output_0">
					<dim>1</dim>
					<dim>2</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="/Concat_3" type="Const" version="opset1">
			<data element_type="i64" shape="1, 1, 256, 3" offset="8224" size="6144" />
			<output>
				<port id="0" precision="I64" names="/Concat_3_output_0">
					<dim>1</dim>
					<dim>1</dim>
					<dim>256</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="/ScatterND_1" type="ScatterNDUpdate" version="opset4">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>2</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
					<dim>1</dim>
					<dim>256</dim>
					<dim>3</dim>
				</port>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="FP32" names="/ScatterND_1_output_0">
					<dim>1</dim>
					<dim>2</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="/Concat_5" type="Const" version="opset1">
			<data element_type="i64" shape="1, 1, 256, 3" offset="15448" size="6144" />
			<output>
				<port id="0" precision="I64" names="/Concat_5_output_0">
					<dim>1</dim>
					<dim>1</dim>
					<dim>256</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="/Constant_2" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="14376" size="8" />
			<output>
				<port id="0" precision="I64" names="/Constant_2_output_0" />
			</output>
		</layer>
		<layer id="34" name="Constant_15652" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="14376" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="35" name="/Gather_2" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>2</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="I64" />
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="FP32" names="/Gather_2_output_0">
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="prompt_encoder.point_embeddings.3.weight" type="Const" version="opset1">
			<data element_type="f32" shape="1, 256" offset="21592" size="1024" />
			<output>
				<port id="0" precision="FP32" names="prompt_encoder.point_embeddings.3.weight">
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="/Add_1" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/Add_1_output_0">
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="/Expand_8" type="Broadcast" version="opset3">
			<data mode="bidirectional" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/Expand_12_output_0,/Expand_8_output_0">
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="/Concat_6" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="15424" size="24" />
			<output>
				<port id="0" precision="I64" names="/Concat_6_output_0">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="/Reshape_3" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/Reshape_3_output_0,/Reshape_4_output_0">
					<dim>1</dim>
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="/ScatterND_2" type="ScatterNDUpdate" version="opset4">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>2</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
					<dim>1</dim>
					<dim>256</dim>
					<dim>3</dim>
				</port>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="FP32" names="/ScatterND_2_output_0">
					<dim>1</dim>
					<dim>2</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="/Concat_7" type="Const" version="opset1">
			<data element_type="i64" shape="1, 1, 256, 3" offset="15448" size="6144" />
			<output>
				<port id="0" precision="I64" names="/Concat_7_output_0">
					<dim>1</dim>
					<dim>1</dim>
					<dim>256</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="/ScatterND_3" type="ScatterNDUpdate" version="opset4">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>2</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
					<dim>1</dim>
					<dim>256</dim>
					<dim>3</dim>
				</port>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="FP32" names="/ScatterND_3_output_0">
					<dim>1</dim>
					<dim>2</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="/mask_decoder/Concat" type="Concat" version="opset1">
			<data axis="1" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>5</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>2</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/mask_decoder/Concat_output_0">
					<dim>1</dim>
					<dim>7</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="Transpose_19246" type="Const" version="opset1">
			<data element_type="f32" shape="256, 256" offset="22616" size="262144" />
			<output>
				<port id="0" precision="FP32">
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="/mask_decoder/transformer/layers.0/self_attn/q_proj/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>7</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/mask_decoder/transformer/layers.0/self_attn/q_proj/MatMul_output_0">
					<dim>1</dim>
					<dim>7</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="/mask_decoder/transformer/layers.0/self_attn/q_proj/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>7</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/mask_decoder/transformer/layers.0/self_attn/q_proj/Add_output_0">
					<dim>1</dim>
					<dim>7</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="/mask_decoder/transformer/layers.0/self_attn/Constant" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="284760" size="32" />
			<output>
				<port id="0" precision="I64" names="/mask_decoder/transformer/layers.0/self_attn/Constant_output_0">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="/mask_decoder/transformer/layers.0/self_attn/Reshape" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>7</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/mask_decoder/transformer/layers.0/self_attn/Reshape_output_0">
					<dim>1</dim>
					<dim>7</dim>
					<dim>8</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="Constant_15920" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="284792" size="32" />
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="/mask_decoder/transformer/layers.0/self_attn/Transpose" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>7</dim>
					<dim>8</dim>
					<dim>32</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/mask_decoder/transformer/layers.0/self_attn/Transpose_output_0">
					<dim>1</dim>
					<dim>8</dim>
					<dim>7</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="Constant_19729" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 256" offset="284824" size="1024" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="Transpose_19253" type="Const" version="opset1">
			<data element_type="f32" shape="256, 256" offset="285848" size="262144" />
			<output>
				<port id="0" precision="FP32">
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="/mask_decoder/transformer/layers.0/self_attn/k_proj/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>7</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/mask_decoder/transformer/layers.0/self_attn/k_proj/MatMul_output_0">
					<dim>1</dim>
					<dim>7</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="/mask_decoder/transformer/layers.0/self_attn/k_proj/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>7</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/mask_decoder/transformer/layers.0/self_attn/k_proj/Add_output_0">
					<dim>1</dim>
					<dim>7</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="/mask_decoder/transformer/layers.0/self_attn/Constant_1" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="284760" size="32" />
			<output>
				<port id="0" precision="I64" names="/mask_decoder/transformer/layers.0/self_attn/Constant_1_output_0">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="/mask_decoder/transformer/layers.0/self_attn/Reshape_1" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>7</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/mask_decoder/transformer/layers.0/self_attn/Reshape_1_output_0">
					<dim>1</dim>
					<dim>7</dim>
					<dim>8</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="Constant_15928" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="547992" size="32" />
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="/mask_decoder/transformer/layers.0/self_attn/Transpose_2" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>7</dim>
					<dim>8</dim>
					<dim>32</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/mask_decoder/transformer/layers.0/self_attn/Transpose_2_output_0">
					<dim>1</dim>
					<dim>8</dim>
					<dim>32</dim>
					<dim>7</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="Constant_19730" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1, 1" offset="548024" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="Multiply_19610" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>32</dim>
					<dim>7</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>32</dim>
					<dim>7</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="/mask_decoder/transformer/layers.0/self_attn/Div" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="false" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>7</dim>
					<dim>32</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>32</dim>
					<dim>7</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/mask_decoder/transformer/layers.0/self_attn/Div_output_0">
					<dim>1</dim>
					<dim>8</dim>
					<dim>7</dim>
					<dim>7</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="/mask_decoder/transformer/layers.0/self_attn/Softmax" type="SoftMax" version="opset8">
			<data axis="-1" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>7</dim>
					<dim>7</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/mask_decoder/transformer/layers.0/self_attn/Softmax_output_0">
					<dim>1</dim>
					<dim>8</dim>
					<dim>7</dim>
					<dim>7</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="Constant_19731" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 256" offset="548028" size="1024" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="Transpose_19262" type="Const" version="opset1">
			<data element_type="f32" shape="256, 256" offset="549052" size="262144" />
			<output>
				<port id="0" precision="FP32">
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="/mask_decoder/transformer/layers.0/self_attn/v_proj/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>7</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/mask_decoder/transformer/layers.0/self_attn/v_proj/MatMul_output_0">
					<dim>1</dim>
					<dim>7</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="/mask_decoder/transformer/layers.0/self_attn/v_proj/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>7</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/mask_decoder/transformer/layers.0/self_attn/v_proj/Add_output_0">
					<dim>1</dim>
					<dim>7</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="/mask_decoder/transformer/layers.0/self_attn/Constant_2" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="284760" size="32" />
			<output>
				<port id="0" precision="I64" names="/mask_decoder/transformer/layers.0/self_attn/Constant_2_output_0">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="/mask_decoder/transformer/layers.0/self_attn/Reshape_2" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>7</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/mask_decoder/transformer/layers.0/self_attn/Reshape_2_output_0">
					<dim>1</dim>
					<dim>7</dim>
					<dim>8</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="Constant_15926" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="284792" size="32" />
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="/mask_decoder/transformer/layers.0/self_attn/Transpose_1" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>7</dim>
					<dim>8</dim>
					<dim>32</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/mask_decoder/transformer/layers.0/self_attn/Transpose_1_output_0">
					<dim>1</dim>
					<dim>8</dim>
					<dim>7</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="72" name="/mask_decoder/transformer/layers.0/self_attn/MatMul_1" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="false" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>7</dim>
					<dim>7</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>7</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/mask_decoder/transformer/layers.0/self_attn/MatMul_1_output_0">
					<dim>1</dim>
					<dim>8</dim>
					<dim>7</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="Constant_15935" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="284792" size="32" />
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="/mask_decoder/transformer/layers.0/self_attn/Transpose_3" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>7</dim>
					<dim>32</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/mask_decoder/transformer/layers.0/self_attn/Transpose_3_output_0">
					<dim>1</dim>
					<dim>7</dim>
					<dim>8</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="/mask_decoder/transformer/layers.0/self_attn/Constant_4" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="811196" size="24" />
			<output>
				<port id="0" precision="I64" names="/mask_decoder/transformer/layers.0/self_attn/Constant_4_output_0">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="/mask_decoder/transformer/layers.0/self_attn/Reshape_3" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>7</dim>
					<dim>8</dim>
					<dim>32</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/mask_decoder/transformer/layers.0/self_attn/Reshape_3_output_0">
					<dim>1</dim>
					<dim>7</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="Transpose_19271" type="Const" version="opset1">
			<data element_type="f32" shape="256, 256" offset="811220" size="262144" />
			<output>
				<port id="0" precision="FP32">
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="78" name="/mask_decoder/transformer/layers.0/self_attn/out_proj/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>7</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/mask_decoder/transformer/layers.0/self_attn/out_proj/MatMul_output_0">
					<dim>1</dim>
					<dim>7</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="/mask_decoder/transformer/layers.0/self_attn/out_proj/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>7</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/mask_decoder/transformer/layers.0/self_attn/out_proj/Add_output_0">
					<dim>1</dim>
					<dim>7</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="Range_15944" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="1073364" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="81" name="MVN_15945" type="MVN" version="opset6">
			<data eps="9.9999997473787516e-06" normalize_variance="true" eps_mode="INSIDE_SQRT" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>7</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>7</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="82" name="Constant_19733" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 256" offset="1073372" size="1024" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="83" name="Multiply_15946" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>7</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>7</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="84" name="Constant_19734" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 256" offset="1074396" size="1024" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="85" name="/mask_decoder/transformer/layers.0/norm1/LayerNormalization" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>7</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/mask_decoder/transformer/layers.0/norm1/LayerNormalization_output_0">
					<dim>1</dim>
					<dim>7</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="86" name="Constant_19739" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 256" offset="1075420" size="1024" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="87" name="Constant_19735" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 128" offset="1076444" size="512" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="88" name="/mask_decoder/transformer/layers.0/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>7</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>7</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/mask_decoder/transformer/layers.0/Add_output_0">
					<dim>1</dim>
					<dim>7</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="89" name="Transpose_19284" type="Const" version="opset1">
			<data element_type="f32" shape="128, 256" offset="1076956" size="131072" />
			<output>
				<port id="0" precision="FP32">
					<dim>128</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="90" name="/mask_decoder/transformer/layers.0/cross_attn_token_to_image/q_proj/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>7</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>128</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/mask_decoder/transformer/layers.0/cross_attn_token_to_image/q_proj/MatMul_output_0">
					<dim>1</dim>
					<dim>7</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="91" name="/mask_decoder/transformer/layers.0/cross_attn_token_to_image/q_proj/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>7</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/mask_decoder/transformer/layers.0/cross_attn_token_to_image/q_proj/Add_output_0">
					<dim>1</dim>
					<dim>7</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="92" name="/mask_decoder/transformer/layers.0/cross_attn_token_to_image/Constant" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="1208028" size="32" />
			<output>
				<port id="0" precision="I64" names="/mask_decoder/transformer/layers.0/cross_attn_token_to_image/Constant_output_0">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="93" name="/mask_decoder/transformer/layers.0/cross_attn_token_to_image/Reshape" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>7</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/mask_decoder/transformer/layers.0/cross_attn_token_to_image/Reshape_output_0">
					<dim>1</dim>
					<dim>7</dim>
					<dim>8</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="94" name="Constant_15958" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="284792" size="32" />
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="95" name="/mask_decoder/transformer/layers.0/cross_attn_token_to_image/Transpose" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>7</dim>
					<dim>8</dim>
					<dim>16</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/mask_decoder/transformer/layers.0/cross_attn_token_to_image/Transpose_output_0">
					<dim>1</dim>
					<dim>8</dim>
					<dim>7</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="96" name="Constant_19736" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 128" offset="1208060" size="512" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="97" name="/Expand_16" type="Const" version="opset1">
			<data element_type="f32" shape="1, 256, 64, 64" offset="1208572" size="4194304" />
			<output>
				<port id="0" precision="FP32" names="/Expand_16_output_0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="98" name="/mask_decoder/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/mask_decoder/Add_output_0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="99" name="Constant_19889" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="5402876" size="24" />
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="100" name="/mask_decoder/transformer/Reshape" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/mask_decoder/transformer/Reshape_output_0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>4096</dim>
				</port>
			</output>
		</layer>
		<layer id="101" name="Constant_15894" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="5402900" size="24" />
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="102" name="/mask_decoder/transformer/Transpose" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>4096</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/mask_decoder/transformer/Transpose_output_0">
					<dim>1</dim>
					<dim>4096</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="103" name="/mask_decoder/transformer/Transpose_1" type="Const" version="opset1">
			<data element_type="f32" shape="1, 4096, 256" offset="5402924" size="4194304" />
			<output>
				<port id="0" precision="FP32" names="/mask_decoder/transformer/Transpose_1_output_0">
					<dim>1</dim>
					<dim>4096</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="104" name="/mask_decoder/transformer/layers.0/Add_1" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>4096</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>4096</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/mask_decoder/transformer/layers.0/Add_1_output_0">
					<dim>1</dim>
					<dim>4096</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="105" name="Transpose_19295" type="Const" version="opset1">
			<data element_type="f32" shape="128, 256" offset="9597228" size="131072" />
			<output>
				<port id="0" precision="FP32">
					<dim>128</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="106" name="/mask_decoder/transformer/layers.0/cross_attn_token_to_image/k_proj/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>4096</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>128</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/mask_decoder/transformer/layers.0/cross_attn_token_to_image/k_proj/MatMul_output_0">
					<dim>1</dim>
					<dim>4096</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="107" name="/mask_decoder/transformer/layers.0/cross_attn_token_to_image/k_proj/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>4096</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/mask_decoder/transformer/layers.0/cross_attn_token_to_image/k_proj/Add_output_0">
					<dim>1</dim>
					<dim>4096</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="108" name="/mask_decoder/transformer/layers.0/cross_attn_token_to_image/Constant_1" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="9728300" size="32" />
			<output>
				<port id="0" precision="I64" names="/mask_decoder/transformer/layers.0/cross_attn_token_to_image/Constant_1_output_0">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="109" name="/mask_decoder/transformer/layers.0/cross_attn_token_to_image/Reshape_1" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>4096</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/mask_decoder/transformer/layers.0/cross_attn_token_to_image/Reshape_1_output_0">
					<dim>1</dim>
					<dim>4096</dim>
					<dim>8</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="110" name="Constant_15966" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="547992" size="32" />
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="111" name="/mask_decoder/transformer/layers.0/cross_attn_token_to_image/Transpose_2" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>4096</dim>
					<dim>8</dim>
					<dim>16</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/mask_decoder/transformer/layers.0/cross_attn_token_to_image/Transpose_2_output_0">
					<dim>1</dim>
					<dim>8</dim>
					<dim>16</dim>
					<dim>4096</dim>
				</port>
			</output>
		</layer>
		<layer id="112" name="Constant_19737" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1, 1" offset="9728332" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="113" name="Multiply_19612" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>16</dim>
					<dim>4096</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>16</dim>
					<dim>4096</dim>
				</port>
			</output>
		</layer>
		<layer id="114" name="/mask_decoder/transformer/layers.0/cross_attn_token_to_image/Div" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="false" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>7</dim>
					<dim>16</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>16</dim>
					<dim>4096</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/mask_decoder/transformer/layers.0/cross_attn_token_to_image/Div_output_0">
					<dim>1</dim>
					<dim>8</dim>
					<dim>7</dim>
					<dim>4096</dim>
				</port>
			</output>
		</layer>
		<layer id="115" name="/mask_decoder/transformer/layers.0/cross_attn_token_to_image/Softmax" type="SoftMax" version="opset8">
			<data axis="-1" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>7</dim>
					<dim>4096</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/mask_decoder/transformer/layers.0/cross_attn_token_to_image/Softmax_output_0">
					<dim>1</dim>
					<dim>8</dim>
					<dim>7</dim>
					<dim>4096</dim>
				</port>
			</output>
		</layer>
		<layer id="116" name="Constant_19738" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 128" offset="9728336" size="512" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="117" name="Transpose_19304" type="Const" version="opset1">
			<data element_type="f32" shape="128, 256" offset="9728848" size="131072" />
			<output>
				<port id="0" precision="FP32">
					<dim>128</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="118" name="/mask_decoder/transformer/layers.0/cross_attn_token_to_image/v_proj/MatMul" type="MatMul" version="opset1">
			<data transpose_a="true" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>4096</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>128</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/mask_decoder/transformer/layers.0/cross_attn_token_to_image/v_proj/MatMul_output_0">
					<dim>1</dim>
					<dim>4096</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="119" name="/mask_decoder/transformer/layers.0/cross_attn_token_to_image/v_proj/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>4096</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/mask_decoder/transformer/layers.0/cross_attn_token_to_image/v_proj/Add_output_0">
					<dim>1</dim>
					<dim>4096</dim>
					<dim>128</dim>
				</port>
			</output>
