<?xml version="1.0"?>
<net name="main_graph" version="11">
	<layers>
		<layer id="1" name="image_embeddings" type="Parameter" version="opset1">
			<data shape="1,256,64,64" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="image_embeddings">
					<dim>1</dim>
					<dim>256</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="0" name="boxes" type="Parameter" version="opset1">
			<data shape="?,4" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="boxes">
					<dim>-1</dim>
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="Constant_9234" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 256" offset="0" size="1024" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="Constant_9230" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 256" offset="1024" size="1024" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="onnx::Expand_1619" type="Const" version="opset1">
			<data element_type="f32" shape="1, 5, 256" offset="2048" size="5120" />
			<output>
				<port id="0" precision="FP32" names="onnx::Expand_1619">
					<dim>1</dim>
					<dim>5</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="Constant_9218" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1" offset="7168" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="/prompt_encoder/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>4</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/prompt_encoder/Add_output_0">
					<dim>-1</dim>
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="/prompt_encoder/Constant_6_output_0" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="7172" size="24" />
			<output>
				<port id="0" precision="I64" names="/prompt_encoder/Constant_6_output_0">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="/prompt_encoder/Reshape" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>4</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/prompt_encoder/Reshape_output_0">
					<dim>-1</dim>
					<dim>2</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="ShapeOf_9716" type="ShapeOf" version="opset3">
			<data output_type="i64" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>2</dim>
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64" names="onnx::Gather_164,onnx::Gather_229">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="Constant_9717" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="7196" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="11" name="Constant_9718" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="7196" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="12" name="Gather_9719" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
				<port id="1" precision="I64" />
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="I64" names="onnx::Cast_166,onnx::Cast_231,onnx::Cast_306,onnx::Cast_366,onnx::Cast_427,onnx::Cast_487" />
			</output>
		</layer>
		<layer id="13" name="Constant_9754" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="7204" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="Reshape_9755" type="Reshape" version="opset1">
			<data special_zero="false" />
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="/mask_decoder/Gather_1_output_0,/mask_decoder/Gather_output_0,/mask_decoder/Reshape_1_output_0,/mask_decoder/Unsqueeze_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="/prompt_encoder/Constant_11_output_0" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="7212" size="8" />
			<output>
				<port id="0" precision="I64" names="/prompt_encoder/Constant_11_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="/mask_decoder/Concat" type="Concat" version="opset1">
			<data axis="0" />
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="I64" names="/mask_decoder/Concat_output_0">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="/prompt_encoder/Mul_output_0" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="7220" size="24" />
			<output>
				<port id="0" precision="I64" names="/prompt_encoder/Mul_output_0">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="/mask_decoder/Equal" type="Equal" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="BOOL" names="/mask_decoder/Equal_output_0">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="/prompt_encoder/ConstantOfShape_1_output_0" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="7244" size="24" />
			<output>
				<port id="0" precision="I64" names="/prompt_encoder/ConstantOfShape_1_output_0">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="/mask_decoder/Where" type="Select" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="BOOL">
					<dim>3</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
				<port id="2" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="I64" names="/mask_decoder/Where_output_0">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="/mask_decoder/Expand" type="Broadcast" version="opset3">
			<data mode="bidirectional" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>5</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/mask_decoder/Expand_output_0">
					<dim>-1</dim>
					<dim>5</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="/prompt_encoder/Constant_output_0" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="7196" size="8" />
			<output>
				<port id="0" precision="I64" names="/prompt_encoder/Constant_output_0" />
			</output>
		</layer>
		<layer id="23" name="/prompt_encoder/Constant_4_output_0" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="7204" size="8" />
			<output>
				<port id="0" precision="I64" names="/prompt_encoder/Constant_4_output_0" />
			</output>
		</layer>
		<layer id="24" name="Range_456" type="Range" version="opset4">
			<data output_type="i64" />
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64" />
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="I64" names="onnx::Reshape_170,onnx::Reshape_235,onnx::Reshape_310,onnx::Reshape_370,onnx::Reshape_431,onnx::Reshape_491">
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="onnx::Reshape_179" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="7268" size="24" />
			<output>
				<port id="0" precision="I64" names="onnx::Reshape_179">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="Reshape_466" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="I64">
					<dim>-1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="onnx::Add_180,onnx::Add_245,onnx::Add_319,onnx::Add_379,onnx::Add_440,onnx::Add_500">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="Constant_9219" type="Const" version="opset1">
			<data element_type="i64" shape="1, 2, 1" offset="7292" size="16" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
					<dim>2</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="/prompt_encoder/Add_1" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="I64">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
					<dim>2</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="/prompt_encoder/Add_1_output_0">
					<dim>-1</dim>
					<dim>2</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="/prompt_encoder/Shape_2" type="ShapeOf" version="opset3">
			<data output_type="i64" />
			<input>
				<port id="0" precision="I64">
					<dim>-1</dim>
					<dim>2</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64" names="/prompt_encoder/Shape_2_output_0,/prompt_encoder/Shape_8_output_0">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="/prompt_encoder/Equal" type="Equal" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="BOOL" names="/prompt_encoder/Equal_3_output_0,/prompt_encoder/Equal_output_0">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="/prompt_encoder/Where" type="Select" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="BOOL">
					<dim>3</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
				<port id="2" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="I64" names="/prompt_encoder/Where_3_output_0,/prompt_encoder/Where_output_0">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="/prompt_encoder/Expand_1" type="Broadcast" version="opset3">
			<data mode="bidirectional" />
			<input>
				<port id="0" precision="I64">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="/prompt_encoder/Expand_1_output_0,/prompt_encoder/Expand_5_output_0">
					<dim>-1</dim>
					<dim>2</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="/prompt_encoder/Unsqueeze_1" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="I64">
					<dim>-1</dim>
					<dim>2</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="/prompt_encoder/Unsqueeze_1_output_0,/prompt_encoder/Unsqueeze_4_output_0">
					<dim>-1</dim>
					<dim>2</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="onnx::Add_182" type="Const" version="opset1">
			<data element_type="i64" shape="2, 1" offset="7292" size="16" />
			<output>
				<port id="0" precision="I64" names="onnx::Add_182">
					<dim>2</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="/prompt_encoder/Expand_2" type="Broadcast" version="opset3">
			<data mode="bidirectional" />
			<input>
				<port id="0" precision="I64">
					<dim>2</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="/prompt_encoder/Expand_2_output_0,/prompt_encoder/Expand_6_output_0">
					<dim>-1</dim>
					<dim>2</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="/prompt_encoder/Unsqueeze_2" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="I64">
					<dim>-1</dim>
					<dim>2</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="/prompt_encoder/Unsqueeze_2_output_0,/prompt_encoder/Unsqueeze_5_output_0">
					<dim>-1</dim>
					<dim>2</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="onnx::Unsqueeze_144" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="7196" size="8" />
			<output>
				<port id="0" precision="I64" names="onnx::Unsqueeze_144">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="/prompt_encoder/Expand_3" type="Broadcast" version="opset3">
			<data mode="bidirectional" />
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="/prompt_encoder/Expand_3_output_0">
					<dim>-1</dim>
					<dim>2</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="/prompt_encoder/Unsqueeze_3" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="I64">
					<dim>-1</dim>
					<dim>2</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="/prompt_encoder/Unsqueeze_3_output_0">
					<dim>-1</dim>
					<dim>2</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="/prompt_encoder/Concat_1" type="Concat" version="opset1">
			<data axis="-1" />
			<input>
				<port id="0" precision="I64">
					<dim>-1</dim>
					<dim>2</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>-1</dim>
					<dim>2</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>-1</dim>
					<dim>2</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="I64" names="/prompt_encoder/Concat_1_output_0">
					<dim>-1</dim>
					<dim>2</dim>
					<dim>1</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="Constant_169" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="7308" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="42" name="/prompt_encoder/Gather_1" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>2</dim>
					<dim>2</dim>
				</port>
				<port id="1" precision="I64" />
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="FP32" names="/prompt_encoder/Gather_1_output_0">
					<dim>-1</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="Constant_9220" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1" offset="7316" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="/prompt_encoder/Div" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>2</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/prompt_encoder/Div_output_0">
					<dim>-1</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="Constant_6107" type="Const" version="opset1">
			<data element_type="i64" shape="2" offset="7292" size="16" />
			<output>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="Constant_6105" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="7196" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="47" name="/prompt_encoder/Shape_1" type="Gather" version="opset1">
			<input>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="I64" names="/prompt_encoder/Shape_1_output_0,/prompt_encoder/Shape_7_output_0">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="/prompt_encoder/Expand" type="Broadcast" version="opset3">
			<data mode="bidirectional" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>2</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/prompt_encoder/Expand_output_0">
					<dim>-1</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="Constant_9845" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="7320" size="24" />
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="/prompt_encoder/Reshape_1" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>2</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/prompt_encoder/Reshape_1_output_0">
					<dim>-1</dim>
					<dim>2</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="/prompt_encoder/ScatterND" type="ScatterNDUpdate" version="opset4">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>2</dim>
					<dim>2</dim>
				</port>
				<port id="1" precision="I64">
					<dim>-1</dim>
					<dim>2</dim>
					<dim>1</dim>
					<dim>3</dim>
				</port>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>2</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="FP32" names="/prompt_encoder/ScatterND_output_0">
					<dim>-1</dim>
					<dim>2</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="onnx::Expand_243" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="7204" size="8" />
			<output>
				<port id="0" precision="I64" names="onnx::Expand_243">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="/prompt_encoder/Expand_7" type="Broadcast" version="opset3">
			<data mode="bidirectional" />
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="/prompt_encoder/Expand_7_output_0">
					<dim>-1</dim>
					<dim>2</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="/prompt_encoder/Unsqueeze_6" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="I64">
					<dim>-1</dim>
					<dim>2</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="/prompt_encoder/Unsqueeze_6_output_0">
					<dim>-1</dim>
					<dim>2</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="/prompt_encoder/Concat_3" type="Concat" version="opset1">
			<data axis="-1" />
			<input>
				<port id="0" precision="I64">
					<dim>-1</dim>
					<dim>2</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>-1</dim>
					<dim>2</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>-1</dim>
					<dim>2</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="I64" names="/prompt_encoder/Concat_3_output_0">
					<dim>-1</dim>
					<dim>2</dim>
					<dim>1</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="Constant_207" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="7308" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="57" name="/prompt_encoder/Gather_3" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>2</dim>
					<dim>2</dim>
				</port>
				<port id="1" precision="I64" />
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="FP32" names="/prompt_encoder/Gather_3_output_0">
					<dim>-1</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="Constant_9222" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1" offset="7316" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="/prompt_encoder/Div_1" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>2</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/prompt_encoder/Div_1_output_0">
					<dim>-1</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="/prompt_encoder/Expand_4" type="Broadcast" version="opset3">
			<data mode="bidirectional" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>2</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/prompt_encoder/Expand_4_output_0">
					<dim>-1</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="Constant_9846" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="7320" size="24" />
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="/prompt_encoder/Reshape_2" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>2</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/prompt_encoder/Reshape_2_output_0">
					<dim>-1</dim>
					<dim>2</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="/prompt_encoder/ScatterND_1" type="ScatterNDUpdate" version="opset4">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>2</dim>
					<dim>2</dim>
				</port>
				<port id="1" precision="I64">
					<dim>-1</dim>
					<dim>2</dim>
					<dim>1</dim>
					<dim>3</dim>
				</port>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>2</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="FP32" names="/prompt_encoder/ScatterND_1_output_0">
					<dim>-1</dim>
					<dim>2</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="Constant_9223" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1" offset="7344" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="/prompt_encoder/Mul_6" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>2</dim>
					<dim>2</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/prompt_encoder/Mul_6_output_0">
					<dim>-1</dim>
					<dim>2</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="Constant_9224" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1" offset="7348" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="/prompt_encoder/Sub" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>2</dim>
					<dim>2</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/prompt_encoder/Sub_output_0">
					<dim>-1</dim>
					<dim>2</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="Transpose_6830" type="Const" version="opset1">
			<data element_type="f32" shape="128, 2" offset="7352" size="1024" />
			<output>
				<port id="0" precision="FP32">
					<dim>128</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="/prompt_encoder/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>2</dim>
					<dim>2</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>128</dim>
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/prompt_encoder/MatMul_output_0">
					<dim>-1</dim>
					<dim>2</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="Constant_9225" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1" offset="8376" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="/prompt_encoder/Mul_7" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>2</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/prompt_encoder/Mul_7_output_0">
					<dim>-1</dim>
					<dim>2</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="72" name="/prompt_encoder/Sin" type="Sin" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>2</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/prompt_encoder/Sin_output_0">
					<dim>-1</dim>
					<dim>2</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="/prompt_encoder/Cos" type="Cos" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>2</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/prompt_encoder/Cos_output_0">
					<dim>-1</dim>
					<dim>2</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="/prompt_encoder/Concat_5" type="Concat" version="opset1">
			<data axis="-1" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>2</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>2</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/prompt_encoder/Concat_5_output_0">
					<dim>-1</dim>
					<dim>2</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="Constant_9226" type="Const" version="opset1">
			<data element_type="i64" shape="1, 1, 256" offset="8380" size="2048" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="/prompt_encoder/Add_7" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="I64">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="/prompt_encoder/Add_7_output_0">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="/prompt_encoder/Shape_14" type="ShapeOf" version="opset3">
			<data output_type="i64" />
			<input>
				<port id="0" precision="I64">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64" names="/prompt_encoder/Shape_14_output_0,/prompt_encoder/Shape_20_output_0,/prompt_encoder/Shape_26_output_0,/prompt_encoder/Shape_32_output_0">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="78" name="/prompt_encoder/Equal_6" type="Equal" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="BOOL" names="/prompt_encoder/Equal_12_output_0,/prompt_encoder/Equal_15_output_0,/prompt_encoder/Equal_6_output_0,/prompt_encoder/Equal_9_output_0">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="/prompt_encoder/Where_6" type="Select" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="BOOL">
					<dim>3</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
				<port id="2" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="I64" names="/prompt_encoder/Where_12_output_0,/prompt_encoder/Where_15_output_0,/prompt_encoder/Where_6_output_0,/prompt_encoder/Where_9_output_0">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="/prompt_encoder/Expand_9" type="Broadcast" version="opset3">
			<data mode="bidirectional" />
			<input>
				<port id="0" precision="I64">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="/prompt_encoder/Expand_13_output_0,/prompt_encoder/Expand_17_output_0,/prompt_encoder/Expand_21_output_0,/prompt_encoder/Expand_9_output_0">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="81" name="/prompt_encoder/Unsqueeze_7" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="I64">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="/prompt_encoder/Unsqueeze_10_output_0,/prompt_encoder/Unsqueeze_13_output_0,/prompt_encoder/Unsqueeze_16_output_0,/prompt_encoder/Unsqueeze_7_output_0">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="82" name="onnx::Expand_320" type="Const" version="opset1">
			<data element_type="i64" shape="1, 1" offset="7196" size="8" />
			<output>
				<port id="0" precision="I64" names="onnx::Expand_320">
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="83" name="/prompt_encoder/Expand_10" type="Broadcast" version="opset3">
			<data mode="bidirectional" />
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="/prompt_encoder/Expand_10_output_0,/prompt_encoder/Expand_14_output_0">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="84" name="/prompt_encoder/Unsqueeze_8" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="I64">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="/prompt_encoder/Unsqueeze_11_output_0,/prompt_encoder/Unsqueeze_8_output_0">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="85" name="Constant_2721" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="7196" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="86" name="Constant_2717" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="7212" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="87" name="Constant_2716" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="10428" size="4" />
			<output>
				<port id="0" precision="I32" />
			</output>
		</layer>
		<layer id="88" name="Gather_2718" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
				<port id="1" precision="I64" />
				<port id="2" precision="I32" />
			</input>
			<output>
				<port id="3" precision="I64" />
			</output>
		</layer>
		<layer id="89" name="Constant_2719" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="7204" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="90" name="Equal_2720" type="Equal" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64" />
			</input>
			<output>
				<port id="2" precision="BOOL" />
			</output>
		</layer>
		<layer id="91" name="Constant_2722" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="10432" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="92" name="Select_2724" type="Select" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="BOOL" />
				<port id="1" precision="I64" />
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="I64" />
			</output>
		</layer>
		<layer id="93" name="Constant_2725" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="7204" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="94" name="Range_2726" type="Range" version="opset4">
			<data output_type="i64" />
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64" />
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="I64">
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="95" name="/prompt_encoder/Expand_11" type="Broadcast" version="opset3">
			<data mode="bidirectional" />
			<input>
				<port id="0" precision="I64">
					<dim>256</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="/prompt_encoder/Expand_11_output_0,/prompt_encoder/Expand_15_output_0,/prompt_encoder/Expand_19_output_0,/prompt_encoder/Expand_23_output_0">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="96" name="/prompt_encoder/Unsqueeze_9" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="I64">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="/prompt_encoder/Unsqueeze_12_output_0,/prompt_encoder/Unsqueeze_15_output_0,/prompt_encoder/Unsqueeze_18_output_0,/prompt_encoder/Unsqueeze_9_output_0">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="97" name="/prompt_encoder/Concat_6" type="Concat" version="opset1">
			<data axis="-1" />
			<input>
				<port id="0" precision="I64">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="I64" names="/prompt_encoder/Concat_6_output_0,/prompt_encoder/Concat_8_output_0">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>256</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="98" name="Constant_253" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="7204" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="99" name="/prompt_encoder/Gather_5" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>2</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="I64" />
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="FP32" names="/prompt_encoder/Gather_5_output_0">
					<dim>-1</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="100" name="prompt_encoder.point_embeddings.2.weight" type="Const" version="opset1">
			<data element_type="f32" shape="1, 256" offset="10440" size="1024" />
			<output>
				<port id="0" precision="FP32" names="prompt_encoder.point_embeddings.2.weight">
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="101" name="/prompt_encoder/Add_5" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/prompt_encoder/Add_5_output_0">
					<dim>-1</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="102" name="Shape_589" type="ShapeOf" version="opset3">
			<data output_type="i64" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>2</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64" names="/mask_decoder/Shape_output_0,onnx::Gather_304,onnx::Gather_364,onnx::Gather_425,onnx::Gather_485">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="103" name="Constant_6115" type="Const" version="opset1">
			<data element_type="i64" shape="2" offset="11464" size="16" />
			<output>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="104" name="Constant_6113" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="7196" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="105" name="/prompt_encoder/Shape_13" type="Gather" version="opset1">
			<input>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="I64" names="/prompt_encoder/Shape_13_output_0,/prompt_encoder/Shape_19_output_0,/prompt_encoder/Shape_25_output_0,/prompt_encoder/Shape_31_output_0">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="106" name="/prompt_encoder/Expand_8" type="Broadcast" version="opset3">
			<data mode="bidirectional" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/prompt_encoder/Expand_12_output_0,/prompt_encoder/Expand_8_output_0">
					<dim>-1</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="107" name="Constant_9847" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="11480" size="24" />
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="108" name="/prompt_encoder/Reshape_3" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/prompt_encoder/Reshape_3_output_0,/prompt_encoder/Reshape_4_output_0">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="109" name="/prompt_encoder/ScatterND_2" type="ScatterNDUpdate" version="opset4">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>2</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="I64">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>256</dim>
					<dim>3</dim>
				</port>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="FP32" names="/prompt_encoder/ScatterND_2_output_0">
					<dim>-1</dim>
					<dim>2</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="110" name="/prompt_encoder/ScatterND_3" type="ScatterNDUpdate" version="opset4">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>2</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="I64">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>256</dim>
					<dim>3</dim>
				</port>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="FP32" names="/prompt_encoder/ScatterND_3_output_0">
					<dim>-1</dim>
					<dim>2</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="111" name="onnx::Expand_441" type="Const" version="opset1">
			<data element_type="i64" shape="1, 1" offset="7204" size="8" />
			<output>
				<port id="0" precision="I64" names="onnx::Expand_441">
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="112" name="/prompt_encoder/Expand_18" type="Broadcast" version="opset3">
			<data mode="bidirectional" />
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="/prompt_encoder/Expand_18_output_0,/prompt_encoder/Expand_22_output_0">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="113" name="/prompt_encoder/Unsqueeze_14" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="I64">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="/prompt_encoder/Unsqueeze_14_output_0,/prompt_encoder/Unsqueeze_17_output_0">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="114" name="/prompt_encoder/Concat_10" type="Concat" version="opset1">
			<data axis="-1" />
			<input>
				<port id="0" precision="I64">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="I64" names="/prompt_encoder/Concat_10_output_0,/prompt_encoder/Concat_12_output_0">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>256</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="115" name="Constant_328" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="7204" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="116" name="/prompt_encoder/Gather_7" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>2</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="I64" />
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="FP32" names="/prompt_encoder/Gather_7_output_0">
					<dim>-1</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="117" name="prompt_encoder.point_embeddings.3.weight" type="Const" version="opset1">
			<data element_type="f32" shape="1, 256" offset="11504" size="1024" />
			<output>
				<port id="0" precision="FP32" names="prompt_encoder.point_embeddings.3.weight">
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="118" name="/prompt_encoder/Add_10" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/prompt_encoder/Add_10_output_0">
					<dim>-1</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="119" name="/prompt_encoder/Expand_16" type="Broadcast" version="opset3">
			<data mode="bidirectional" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/prompt_encoder/Expand_16_output_0,/prompt_encoder/Expand_20_output_0">
					<dim>-1</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="120" name="Constant_9849" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="11480" size="24" />
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="121" name="/prompt_encoder/Reshape_5" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/prompt_encoder/Reshape_5_output_0,/prompt_encoder/Reshape_6_output_0">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="122" name="/prompt_encoder/ScatterND_4" type="ScatterNDUpdate" version="opset4">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>2</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="I64">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>256</dim>
					<dim>3</dim>
				</port>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="FP32" names="/prompt_encoder/ScatterND_4_output_0">
					<dim>-1</dim>
					<dim>2</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="123" name="/prompt_encoder/ScatterND_5" type="ScatterNDUpdate" version="opset4">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>2</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="I64">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>256</dim>
					<dim>3</dim>
				</port>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="FP32" names="/prompt_encoder/Concat_14_output_0,/prompt_encoder/ScatterND_5_output_0">
					<dim>-1</dim>
					<dim>2</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="124" name="/mask_decoder/Concat_1" type="Concat" version="opset1">
			<data axis="1" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>5</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>2</dim>
					<dim>256</dim>
				</port>
			</input>
