<?xml version="1.0"?>
<net name="main_graph" version="11">
	<layers>
		<layer id="0" name="image" type="Parameter" version="opset1">
			<data shape="1,3,256,256" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="image">
					<dim>1</dim>
					<dim>3</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="Constant_8518" type="Const" version="opset1">
			<data element_type="f32" shape="1, 256, 1, 1" offset="0" size="1024" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="Constant_8516" type="Const" version="opset1">
			<data element_type="f32" shape="1, 256, 1, 1" offset="1024" size="1024" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="onnx::Conv_2448" type="Const" version="opset1">
			<data element_type="f32" shape="32, 3, 1, 1" offset="2048" size="384" />
			<output>
				<port id="0" precision="FP32" names="onnx::Conv_2448">
					<dim>32</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="/patch_embed/seq/seq.0/c/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="Reshape_248" type="Const" version="opset1">
			<data element_type="f32" shape="1, 32, 1, 1" offset="2432" size="128" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="/patch_embed/seq/seq.0/c/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/patch_embed/seq/seq.0/c/Conv_output_0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="/patch_embed/seq/seq.1/Mul_1" type="Gelu" version="opset7">
			<data approximation_mode="ERF" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/patch_embed/seq/seq.1/Mul_1_output_0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="onnx::Conv_2451" type="Const" version="opset1">
			<data element_type="f32" shape="64, 32, 1, 1" offset="2560" size="8192" />
			<output>
				<port id="0" precision="FP32" names="onnx::Conv_2451">
					<dim>64</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="/patch_embed/seq/seq.2/c/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="Reshape_266" type="Const" version="opset1">
			<data element_type="f32" shape="1, 64, 1, 1" offset="10752" size="256" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="/patch_embed/seq/seq.2/c/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/patch_embed/seq/seq.2/c/Conv_output_0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="onnx::Conv_2454" type="Const" version="opset1">
			<data element_type="f32" shape="256, 64, 1, 1" offset="11008" size="65536" />
			<output>
				<port id="0" precision="FP32" names="onnx::Conv_2454">
					<dim>256</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="/layers.0/blocks.0/conv1/c/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>256</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="Reshape_279" type="Const" version="opset1">
			<data element_type="f32" shape="1, 256, 1, 1" offset="76544" size="1024" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="/layers.0/blocks.0/conv1/c/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/layers.0/blocks.0/conv1/c/Conv_output_0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="/layers.0/blocks.0/act1/Mul_1" type="Gelu" version="opset7">
			<data approximation_mode="ERF" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/layers.0/blocks.0/act1/Mul_1_output_0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="Reshape_293" type="Const" version="opset1">
			<data element_type="f32" shape="256, 1, 1, 3, 3" offset="77568" size="9216" />
			<output>
				<port id="0" precision="FP32">
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="/layers.0/blocks.0/conv2/c/Conv/WithoutBiases" type="GroupConvolution" version="opset1">
			<data strides="1, 1" pads_begin="1, 1" pads_end="1, 1" dilations="1, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="Reshape_343" type="Const" version="opset1">
			<data element_type="f32" shape="1, 256, 1, 1" offset="86784" size="1024" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="/layers.0/blocks.0/conv2/c/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/layers.0/blocks.0/conv2/c/Conv_output_0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="/layers.0/blocks.0/act2/Mul_1" type="Gelu" version="opset7">
			<data approximation_mode="ERF" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/layers.0/blocks.0/act2/Mul_1_output_0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="onnx::Conv_2460" type="Const" version="opset1">
			<data element_type="f32" shape="64, 256, 1, 1" offset="87808" size="65536" />
			<output>
				<port id="0" precision="FP32" names="onnx::Conv_2460">
					<dim>64</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="/layers.0/blocks.0/conv3/c/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="Reshape_361" type="Const" version="opset1">
			<data element_type="f32" shape="1, 64, 1, 1" offset="153344" size="256" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="/layers.0/blocks.0/conv3/c/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/layers.0/blocks.0/conv3/c/Conv_output_0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="/layers.0/blocks.0/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/layers.0/blocks.0/Add_output_0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="/layers.0/blocks.0/act3/Mul_1" type="Gelu" version="opset7">
			<data approximation_mode="ERF" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/layers.0/blocks.0/act3/Mul_1_output_0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="onnx::Conv_2463" type="Const" version="opset1">
			<data element_type="f32" shape="256, 64, 1, 1" offset="153600" size="65536" />
			<output>
				<port id="0" precision="FP32" names="onnx::Conv_2463">
					<dim>256</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="/layers.0/blocks.1/conv1/c/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>256</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="Reshape_380" type="Const" version="opset1">
			<data element_type="f32" shape="1, 256, 1, 1" offset="219136" size="1024" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="/layers.0/blocks.1/conv1/c/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/layers.0/blocks.1/conv1/c/Conv_output_0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="/layers.0/blocks.1/act1/Mul_1" type="Gelu" version="opset7">
			<data approximation_mode="ERF" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/layers.0/blocks.1/act1/Mul_1_output_0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="Reshape_394" type="Const" version="opset1">
			<data element_type="f32" shape="256, 1, 1, 3, 3" offset="220160" size="9216" />
			<output>
				<port id="0" precision="FP32">
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="/layers.0/blocks.1/conv2/c/Conv/WithoutBiases" type="GroupConvolution" version="opset1">
			<data strides="1, 1" pads_begin="1, 1" pads_end="1, 1" dilations="1, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="Reshape_444" type="Const" version="opset1">
			<data element_type="f32" shape="1, 256, 1, 1" offset="229376" size="1024" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="/layers.0/blocks.1/conv2/c/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/layers.0/blocks.1/conv2/c/Conv_output_0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="/layers.0/blocks.1/act2/Mul_1" type="Gelu" version="opset7">
			<data approximation_mode="ERF" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/layers.0/blocks.1/act2/Mul_1_output_0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="onnx::Conv_2469" type="Const" version="opset1">
			<data element_type="f32" shape="64, 256, 1, 1" offset="230400" size="65536" />
			<output>
				<port id="0" precision="FP32" names="onnx::Conv_2469">
					<dim>64</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="/layers.0/blocks.1/conv3/c/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="Reshape_462" type="Const" version="opset1">
			<data element_type="f32" shape="1, 64, 1, 1" offset="295936" size="256" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="/layers.0/blocks.1/conv3/c/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/layers.0/blocks.1/conv3/c/Conv_output_0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="/layers.0/blocks.1/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/layers.0/blocks.1/Add_output_0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="/layers.0/blocks.1/act3/Mul_1" type="Gelu" version="opset7">
			<data approximation_mode="ERF" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/layers.0/blocks.1/act3/Mul_1_output_0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="onnx::Conv_2472" type="Const" version="opset1">
			<data element_type="f32" shape="128, 64, 1, 1" offset="296192" size="32768" />
			<output>
				<port id="0" precision="FP32" names="onnx::Conv_2472">
					<dim>128</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="/layers.0/downsample/conv1/c/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>128</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="Reshape_481" type="Const" version="opset1">
			<data element_type="f32" shape="1, 128, 1, 1" offset="328960" size="512" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="/layers.0/downsample/conv1/c/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/layers.0/downsample/conv1/c/Conv_output_0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="/layers.0/downsample/act/Mul_1" type="Gelu" version="opset7">
			<data approximation_mode="ERF" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/layers.0/downsample/act/Mul_1_output_0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="Reshape_495" type="Const" version="opset1">
			<data element_type="f32" shape="128, 1, 1, 3, 3" offset="329472" size="4608" />
			<output>
				<port id="0" precision="FP32">
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="/layers.0/downsample/conv2/c/Conv/WithoutBiases" type="GroupConvolution" version="opset1">
			<data strides="2, 2" pads_begin="1, 1" pads_end="1, 1" dilations="1, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="Reshape_545" type="Const" version="opset1">
			<data element_type="f32" shape="1, 128, 1, 1" offset="334080" size="512" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="/layers.0/downsample/conv2/c/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/layers.0/downsample/conv2/c/Conv_output_0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="/layers.0/downsample/act_1/Mul_1" type="Gelu" version="opset7">
			<data approximation_mode="ERF" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/layers.0/downsample/act_1/Mul_1_output_0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="onnx::Conv_2478" type="Const" version="opset1">
			<data element_type="f32" shape="128, 128, 1, 1" offset="334592" size="65536" />
			<output>
				<port id="0" precision="FP32" names="onnx::Conv_2478">
					<dim>128</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="/layers.0/downsample/conv3/c/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>128</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="Reshape_563" type="Const" version="opset1">
			<data element_type="f32" shape="1, 128, 1, 1" offset="400128" size="512" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="/layers.0/downsample/conv3/c/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/layers.0/downsample/conv3/c/Conv_output_0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="_v_1961" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="400640" size="24" />
			<output>
				<port id="0" precision="I64" names="_v_1961">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="/layers.0/downsample/Reshape" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/layers.0/downsample/Reshape_output_0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>16384</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="Constant_566" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="400664" size="24" />
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="/layers.0/downsample/Transpose" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>16384</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/layers.0/downsample/Transpose_output_0">
					<dim>1</dim>
					<dim>16384</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="Constant_8421" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 128" offset="400688" size="512" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="Constant_8418" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 384" offset="401200" size="1536" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>384</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="/layers.1/blocks.0/Constant_output_0" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="402736" size="32" />
			<output>
				<port id="0" precision="I64" names="/layers.1/blocks.0/Constant_output_0">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="/layers.1/blocks.0/Reshape" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16384</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/layers.1/blocks.0/Reshape_output_0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="Constant_571" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="402768" size="32" />
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="Constant_572" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="402800" size="32" />
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="Constant_570" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="402832" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="69" name="/layers.1/blocks.0/Pad" type="Pad" version="opset12">
			<data pad_mode="constant" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
				<port id="2" precision="I64">
					<dim>4</dim>
				</port>
				<port id="3" precision="FP32" />
			</input>
			<output>
				<port id="4" precision="FP32" names="/layers.1/blocks.0/Pad_output_0">
					<dim>1</dim>
					<dim>133</dim>
					<dim>133</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="/layers.1/blocks.0/Constant_9_output_0" type="Const" version="opset1">
			<data element_type="i64" shape="6" offset="402836" size="48" />
			<output>
				<port id="0" precision="I64" names="/layers.1/blocks.0/Constant_9_output_0">
					<dim>6</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="/layers.1/blocks.0/Reshape_3" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>133</dim>
					<dim>133</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="I64">
					<dim>6</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/layers.1/blocks.0/Reshape_3_output_0">
					<dim>1</dim>
					<dim>19</dim>
					<dim>7</dim>
					<dim>19</dim>
					<dim>7</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="72" name="Constant_575" type="Const" version="opset1">
			<data element_type="i64" shape="6" offset="402884" size="48" />
			<output>
				<port id="0" precision="I64">
					<dim>6</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="/layers.1/blocks.0/Transpose_1" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>19</dim>
					<dim>7</dim>
					<dim>19</dim>
					<dim>7</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="I64">
					<dim>6</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/layers.1/blocks.0/Transpose_1_output_0">
					<dim>1</dim>
					<dim>19</dim>
					<dim>19</dim>
					<dim>7</dim>
					<dim>7</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="/layers.1/blocks.0/Constant_10_output_0" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="402932" size="24" />
			<output>
				<port id="0" precision="I64" names="/layers.1/blocks.0/Constant_10_output_0">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="/layers.1/blocks.0/Reshape_4" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>19</dim>
					<dim>19</dim>
					<dim>7</dim>
					<dim>7</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/layers.1/blocks.0/Reshape_4_output_0">
					<dim>361</dim>
					<dim>49</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="Range_581" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="402956" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="MVN_582" type="MVN" version="opset6">
			<data eps="9.9999997473787516e-06" normalize_variance="true" eps_mode="INSIDE_SQRT" />
			<input>
				<port id="0" precision="FP32">
					<dim>361</dim>
					<dim>49</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>361</dim>
					<dim>49</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="78" name="Constant_8416" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 128" offset="402964" size="512" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="Multiply_583" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>361</dim>
					<dim>49</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>361</dim>
					<dim>49</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="Constant_8417" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 128" offset="403476" size="512" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="81" name="/layers.1/blocks.0/attn/norm/LayerNormalization" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>361</dim>
					<dim>49</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/layers.1/blocks.0/attn/norm/LayerNormalization_output_0">
					<dim>361</dim>
					<dim>49</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="82" name="Transpose_5741" type="Const" version="opset1">
			<data element_type="f32" shape="384, 128" offset="403988" size="196608" />
			<output>
				<port id="0" precision="FP32">
					<dim>384</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="83" name="/layers.1/blocks.0/attn/qkv/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>361</dim>
					<dim>49</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>384</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/layers.1/blocks.0/attn/qkv/MatMul_output_0">
					<dim>361</dim>
					<dim>49</dim>
					<dim>384</dim>
				</port>
			</output>
		</layer>
		<layer id="84" name="/layers.1/blocks.0/attn/qkv/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>384</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>361</dim>
					<dim>49</dim>
					<dim>384</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/layers.1/blocks.0/attn/qkv/Add_output_0">
					<dim>361</dim>
					<dim>49</dim>
					<dim>384</dim>
				</port>
			</output>
		</layer>
		<layer id="85" name="/layers.1/blocks.0/attn/Constant_output_0" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="600596" size="32" />
			<output>
				<port id="0" precision="I64" names="/layers.1/blocks.0/attn/Constant_output_0">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="86" name="/layers.1/blocks.0/attn/Reshape" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>361</dim>
					<dim>49</dim>
					<dim>384</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/layers.1/blocks.0/attn/Reshape_output_0">
					<dim>361</dim>
					<dim>49</dim>
					<dim>4</dim>
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer id="87" name="Constant_588" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="600628" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="88" name="onnx::Split_490" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="600636" size="24" />
			<output>
				<port id="0" precision="I64" names="onnx::Split_490">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="89" name="/layers.1/blocks.0/attn/Split" type="VariadicSplit" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>361</dim>
					<dim>49</dim>
					<dim>4</dim>
					<dim>96</dim>
				</port>
				<port id="1" precision="I64" />
				<port id="2" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="FP32" names="/layers.1/blocks.0/attn/Split_output_0">
					<dim>361</dim>
					<dim>49</dim>
					<dim>4</dim>
					<dim>32</dim>
				</port>
				<port id="4" precision="FP32" names="/layers.1/blocks.0/attn/Split_output_1">
					<dim>361</dim>
					<dim>49</dim>
					<dim>4</dim>
					<dim>32</dim>
				</port>
				<port id="5" precision="FP32" names="/layers.1/blocks.0/attn/Split_output_2">
					<dim>361</dim>
					<dim>49</dim>
					<dim>4</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="90" name="Constant_590" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="600660" size="32" />
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="91" name="/layers.1/blocks.0/attn/Transpose" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>361</dim>
					<dim>49</dim>
					<dim>4</dim>
					<dim>32</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/layers.1/blocks.0/attn/Transpose_output_0">
					<dim>361</dim>
					<dim>4</dim>
					<dim>49</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="92" name="Constant_594" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="600692" size="32" />
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="93" name="/layers.1/blocks.0/attn/Transpose_2" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>361</dim>
					<dim>49</dim>
					<dim>4</dim>
					<dim>32</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/layers.1/blocks.0/attn/Transpose_2_output_0">
					<dim>361</dim>
					<dim>4</dim>
					<dim>32</dim>
					<dim>49</dim>
				</port>
			</output>
		</layer>
		<layer id="94" name="/layers.1/blocks.0/attn/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="false" />
			<input>
				<port id="0" precision="FP32">
					<dim>361</dim>
					<dim>4</dim>
					<dim>49</dim>
					<dim>32</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>361</dim>
					<dim>4</dim>
					<dim>32</dim>
					<dim>49</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/layers.1/blocks.0/attn/MatMul_output_0">
					<dim>361</dim>
					<dim>4</dim>
					<dim>49</dim>
					<dim>49</dim>
				</port>
			</output>
		</layer>
		<layer id="95" name="Constant_8419" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1, 1" offset="600724" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="96" name="/layers.1/blocks.0/attn/Mul" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>361</dim>
					<dim>4</dim>
					<dim>49</dim>
					<dim>49</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/layers.1/blocks.0/attn/Mul_output_0">
					<dim>361</dim>
					<dim>4</dim>
					<dim>49</dim>
					<dim>49</dim>
				</port>
			</output>
		</layer>
		<layer id="97" name="Constant_8420" type="Const" version="opset1">
			<data element_type="f32" shape="1, 4, 49, 49" offset="600728" size="38416" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>4</dim>
					<dim>49</dim>
					<dim>49</dim>
				</port>
			</output>
		</layer>
		<layer id="98" name="/layers.1/blocks.0/attn/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>361</dim>
					<dim>4</dim>
					<dim>49</dim>
					<dim>49</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>4</dim>
					<dim>49</dim>
					<dim>49</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/layers.1/blocks.0/attn/Add_output_0">
					<dim>361</dim>
					<dim>4</dim>
					<dim>49</dim>
					<dim>49</dim>
				</port>
			</output>
		</layer>
		<layer id="99" name="/layers.1/blocks.0/attn/Softmax" type="SoftMax" version="opset8">
			<data axis="-1" />
			<input>
				<port id="0" precision="FP32">
					<dim>361</dim>
					<dim>4</dim>
					<dim>49</dim>
					<dim>49</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/layers.1/blocks.0/attn/Softmax_output_0">
					<dim>361</dim>
					<dim>4</dim>
					<dim>49</dim>
					<dim>49</dim>
				</port>
			</output>
		</layer>
		<layer id="100" name="Constant_592" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="600660" size="32" />
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="101" name="/layers.1/blocks.0/attn/Transpose_1" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>361</dim>
					<dim>49</dim>
					<dim>4</dim>
					<dim>32</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/layers.1/blocks.0/attn/Transpose_1_output_0">
					<dim>361</dim>
					<dim>4</dim>
					<dim>49</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="102" name="/layers.1/blocks.0/attn/MatMul_1" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="false" />
			<input>
				<port id="0" precision="FP32">
					<dim>361</dim>
					<dim>4</dim>
					<dim>49</dim>
					<dim>49</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>361</dim>
					<dim>4</dim>
					<dim>49</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/layers.1/blocks.0/attn/MatMul_1_output_0">
					<dim>361</dim>
					<dim>4</dim>
					<dim>49</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="103" name="Constant_601" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="600660" size="32" />
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="104" name="/layers.1/blocks.0/attn/Transpose_3" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>361</dim>
					<dim>4</dim>
					<dim>49</dim>
					<dim>32</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/layers.1/blocks.0/attn/Transpose_3_output_0">
					<dim>361</dim>
					<dim>49</dim>
					<dim>4</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="105" name="/layers.1/blocks.0/attn/Reshape_1" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>361</dim>
					<dim>49</dim>
					<dim>4</dim>
					<dim>32</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/layers.1/blocks.0/attn/Reshape_1_output_0">
					<dim>361</dim>
					<dim>49</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="106" name="Transpose_5828" type="Const" version="opset1">
			<data element_type="f32" shape="128, 128" offset="639144" size="65536" />
			<output>
				<port id="0" precision="FP32">
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="107" name="/layers.1/blocks.0/attn/proj/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>361</dim>
					<dim>49</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/layers.1/blocks.0/attn/proj/MatMul_output_0">
					<dim>361</dim>
					<dim>49</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="108" name="/layers.1/blocks.0/attn/proj/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>361</dim>
					<dim>49</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/layers.1/blocks.0/attn/proj/Add_output_0">
					<dim>361</dim>
					<dim>49</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="109" name="/layers.1/blocks.0/Constant_11_output_0" type="Const" version="opset1">
			<data element_type="i64" shape="6" offset="704680" size="48" />
			<output>
				<port id="0" precision="I64" names="/layers.1/blocks.0/Constant_11_output_0">
					<dim>6</dim>
				</port>
			</output>
		</layer>
		<layer id="110" name="/layers.1/blocks.0/Reshape_5" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>361</dim>
					<dim>49</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="I64">
					<dim>6</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/layers.1/blocks.0/Reshape_5_output_0">
					<dim>1</dim>
					<dim>19</dim>
					<dim>19</dim>
					<dim>7</dim>
					<dim>7</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="111" name="Constant_607" type="Const" version="opset1">
			<data element_type="i64" shape="6" offset="402884" size="48" />
			<output>
				<port id="0" precision="I64">
					<dim>6</dim>
				</port>
			</output>
		</layer>
		<layer id="112" name="/layers.1/blocks.0/Transpose_2" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>19</dim>
					<dim>19</dim>
					<dim>7</dim>
					<dim>7</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="I64">
					<dim>6</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/layers.1/blocks.0/Transpose_2_output_0">
					<dim>1</dim>
					<dim>19</dim>
					<dim>7</dim>
					<dim>19</dim>
					<dim>7</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="113" name="/layers.1/blocks.0/Constant_12_output_0" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="704728" size="32" />
			<output>
				<port id="0" precision="I64" names="/layers.1/blocks.0/Constant_12_output_0">
					<dim>4</dim>
				</port>
			</output>
		</layer>
