<?xml version="1.0"?>
<net name="main_graph" version="11">
	<layers>
		<layer id="0" name="image" type="Parameter" version="opset1">
			<data shape="1,3,256,256" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="image">
					<dim>1</dim>
					<dim>3</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="Constant_31381" type="Const" version="opset1">
			<data element_type="f32" shape="1, 256, 1, 1" offset="0" size="1024" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="Constant_31378" type="Const" version="opset1">
			<data element_type="f32" shape="1, 256, 1, 1" offset="1024" size="1024" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="Constant_31210" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1, 1" offset="2048" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="Multiply_10124" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="Constant_10104" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="2052" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="6" name="Range_10100" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="2056" size="32" />
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="ReduceMax_10102" type="ReduceMax" version="opset1">
			<data keep_dims="false" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" />
			</output>
		</layer>
		<layer id="8" name="Maximum_10105" type="Maximum" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32" />
				<port id="1" precision="FP32" />
			</input>
			<output>
				<port id="2" precision="FP32" />
			</output>
		</layer>
		<layer id="9" name="Constant_10115" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="2052" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="10" name="ReduceMin_10113" type="ReduceMin" version="opset1">
			<data keep_dims="false" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" />
			</output>
		</layer>
		<layer id="11" name="Minimum_10116" type="Minimum" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32" />
				<port id="1" precision="FP32" />
			</input>
			<output>
				<port id="2" precision="FP32" />
			</output>
		</layer>
		<layer id="12" name="Subtract_10117" type="Subtract" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32" />
				<port id="1" precision="FP32" />
			</input>
			<output>
				<port id="2" precision="FP32" />
			</output>
		</layer>
		<layer id="13" name="Divide_10125" type="Divide" version="opset1">
			<data auto_broadcast="numpy" m_pythondiv="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="FP32" />
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="Round_10126" type="Round" version="opset5">
			<data mode="half_to_even" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="Constant_10092" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="2052" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="16" name="Subtract_10119" type="Subtract" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32" />
				<port id="1" precision="FP32" />
			</input>
			<output>
				<port id="2" precision="FP32" />
			</output>
		</layer>
		<layer id="17" name="Constant_17267" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="2088" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="18" name="image_QuantizeLinear_image_scale" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32" />
				<port id="1" precision="FP32" />
			</input>
			<output>
				<port id="2" precision="FP32" names="image_scale" />
			</output>
		</layer>
		<layer id="19" name="Divide_10120" type="Divide" version="opset1">
			<data auto_broadcast="numpy" m_pythondiv="true" />
			<input>
				<port id="0" precision="FP32" />
				<port id="1" precision="FP32" />
			</input>
			<output>
				<port id="2" precision="FP32" />
			</output>
		</layer>
		<layer id="20" name="Round_10121" type="Round" version="opset5">
			<data mode="half_to_even" />
			<input>
				<port id="0" precision="FP32" />
			</input>
			<output>
				<port id="1" precision="FP32" />
			</output>
		</layer>
		<layer id="21" name="Clamp_10122" type="Clamp" version="opset1">
			<data min="0" max="255" />
			<input>
				<port id="0" precision="FP32" />
			</input>
			<output>
				<port id="1" precision="FP32" />
			</output>
		</layer>
		<layer id="22" name="image_QuantizeLinear_image_zero_point" type="Convert" version="opset1">
			<data destination_type="u8" />
			<input>
				<port id="0" precision="FP32" />
			</input>
			<output>
				<port id="1" precision="U8" names="image_zero_point" />
			</output>
		</layer>
		<layer id="23" name="Convert_10127" type="Convert" version="opset1">
			<data destination_type="f32" />
			<input>
				<port id="0" precision="U8" />
			</input>
			<output>
				<port id="1" precision="FP32" />
			</output>
		</layer>
		<layer id="24" name="Add_10128" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="FP32" />
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="Clamp_10129" type="Clamp" version="opset1">
			<data min="0" max="255" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="image_QuantizeLinear_image_quantized" type="Convert" version="opset1">
			<data destination_type="u8" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="U8" names="image_quantized">
					<dim>1</dim>
					<dim>3</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="Convert_10159" type="Convert" version="opset1">
			<data destination_type="i32" />
			<input>
				<port id="0" precision="U8">
					<dim>1</dim>
					<dim>3</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="Convert_10161" type="Convert" version="opset1">
			<data destination_type="i32" />
			<input>
				<port id="0" precision="U8" />
			</input>
			<output>
				<port id="1" precision="I32" />
			</output>
		</layer>
		<layer id="29" name="Subtract_10163" type="Subtract" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="I32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="I32" />
			</input>
			<output>
				<port id="2" precision="I32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="Subtract_10164" type="Const" version="opset1">
			<data element_type="i32" shape="32, 3, 1, 1" offset="2092" size="384" />
			<output>
				<port id="0" precision="I32">
					<dim>32</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="/patch_embed/seq/seq.0/c/Conv_quant" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="I32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="I32">
					<dim>32</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I32" names="/patch_embed/seq/seq.0/c/Conv_output_0_output_quantized">
					<dim>1</dim>
					<dim>32</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="/patch_embed/seq/seq.0/c/Conv_output_0_output_quantized_cast" type="Convert" version="opset1">
			<data destination_type="f32" />
			<input>
				<port id="0" precision="I32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/patch_embed/seq/seq.0/c/Conv_output_0_output_quantized_cast_output">
					<dim>1</dim>
					<dim>32</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="onnx::Conv_2448_scale" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="2476" size="4" />
			<output>
				<port id="0" precision="FP32" names="onnx::Conv_2448_scale" />
			</output>
		</layer>
		<layer id="34" name="/patch_embed/seq/seq.0/c/Conv_quant_scales_mul" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32" />
				<port id="1" precision="FP32" />
			</input>
			<output>
				<port id="2" precision="FP32" names="/patch_embed/seq/seq.0/c/Conv_quant_scales_mul:0" />
			</output>
		</layer>
		<layer id="35" name="/patch_embed/seq/seq.0/c/Conv_quant_output_scale_mul" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="FP32" />
			</input>
			<output>
				<port id="2" precision="FP32" names="/patch_embed/seq/seq.0/c/Conv_output_0quant_scaled_output">
					<dim>1</dim>
					<dim>32</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="/patch_embed/seq/seq.0/c/Conv_output_0_bias_reshape_output" type="Const" version="opset1">
			<data element_type="f32" shape="1, 32, 1, 1" offset="2480" size="128" />
			<output>
				<port id="0" precision="FP32" names="/patch_embed/seq/seq.0/c/Conv_output_0_bias_reshape_output">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="/patch_embed/seq/seq.0/c/Conv_output_0_bias_add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/patch_embed/seq/seq.0/c/Conv_output_0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="/patch_embed/seq/seq.1/Mul_1" type="Gelu" version="opset7">
			<data approximation_mode="ERF" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/patch_embed/seq/seq.1/Mul_1_output_0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="Constant_31211" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1, 1" offset="2048" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="Multiply_10206" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="Constant_10186" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="2052" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="42" name="Range_10182" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="2056" size="32" />
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="ReduceMax_10184" type="ReduceMax" version="opset1">
			<data keep_dims="false" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" />
			</output>
		</layer>
		<layer id="44" name="Maximum_10187" type="Maximum" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32" />
				<port id="1" precision="FP32" />
			</input>
			<output>
				<port id="2" precision="FP32" />
			</output>
		</layer>
		<layer id="45" name="Constant_10197" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="2052" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="46" name="ReduceMin_10195" type="ReduceMin" version="opset1">
			<data keep_dims="false" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" />
			</output>
		</layer>
		<layer id="47" name="Minimum_10198" type="Minimum" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32" />
				<port id="1" precision="FP32" />
			</input>
			<output>
				<port id="2" precision="FP32" />
			</output>
		</layer>
		<layer id="48" name="Subtract_10199" type="Subtract" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32" />
				<port id="1" precision="FP32" />
			</input>
			<output>
				<port id="2" precision="FP32" />
			</output>
		</layer>
		<layer id="49" name="Divide_10207" type="Divide" version="opset1">
			<data auto_broadcast="numpy" m_pythondiv="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="FP32" />
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="Round_10208" type="Round" version="opset5">
			<data mode="half_to_even" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="Constant_10174" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="2052" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="52" name="Subtract_10201" type="Subtract" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32" />
				<port id="1" precision="FP32" />
			</input>
			<output>
				<port id="2" precision="FP32" />
			</output>
		</layer>
		<layer id="53" name="Constant_17275" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="2088" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="54" name="/patch_embed/seq/seq.1/Mul_1_output_0_QuantizeLinear_/patch_embed/seq/seq.1/Mul_1_output_0_scale" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32" />
				<port id="1" precision="FP32" />
			</input>
			<output>
				<port id="2" precision="FP32" names="/patch_embed/seq/seq.1/Mul_1_output_0_scale" />
			</output>
		</layer>
		<layer id="55" name="Divide_10202" type="Divide" version="opset1">
			<data auto_broadcast="numpy" m_pythondiv="true" />
			<input>
				<port id="0" precision="FP32" />
				<port id="1" precision="FP32" />
			</input>
			<output>
				<port id="2" precision="FP32" />
			</output>
		</layer>
		<layer id="56" name="Round_10203" type="Round" version="opset5">
			<data mode="half_to_even" />
			<input>
				<port id="0" precision="FP32" />
			</input>
			<output>
				<port id="1" precision="FP32" />
			</output>
		</layer>
		<layer id="57" name="Clamp_10204" type="Clamp" version="opset1">
			<data min="0" max="255" />
			<input>
				<port id="0" precision="FP32" />
			</input>
			<output>
				<port id="1" precision="FP32" />
			</output>
		</layer>
		<layer id="58" name="/patch_embed/seq/seq.1/Mul_1_output_0_QuantizeLinear_/patch_embed/seq/seq.1/Mul_1_output_0_zero_point" type="Convert" version="opset1">
			<data destination_type="u8" />
			<input>
				<port id="0" precision="FP32" />
			</input>
			<output>
				<port id="1" precision="U8" names="/patch_embed/seq/seq.1/Mul_1_output_0_zero_point" />
			</output>
		</layer>
		<layer id="59" name="Convert_10209" type="Convert" version="opset1">
			<data destination_type="f32" />
			<input>
				<port id="0" precision="U8" />
			</input>
			<output>
				<port id="1" precision="FP32" />
			</output>
		</layer>
		<layer id="60" name="Add_10210" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="FP32" />
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="Clamp_10211" type="Clamp" version="opset1">
			<data min="0" max="255" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="/patch_embed/seq/seq.1/Mul_1_output_0_QuantizeLinear_/patch_embed/seq/seq.1/Mul_1_output_0_quantized" type="Convert" version="opset1">
			<data destination_type="u8" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="U8" names="/patch_embed/seq/seq.1/Mul_1_output_0_quantized">
					<dim>1</dim>
					<dim>32</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="Convert_10214" type="Convert" version="opset1">
			<data destination_type="i32" />
			<input>
				<port id="0" precision="U8">
					<dim>1</dim>
					<dim>32</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="Convert_10216" type="Convert" version="opset1">
			<data destination_type="i32" />
			<input>
				<port id="0" precision="U8" />
			</input>
			<output>
				<port id="1" precision="I32" />
			</output>
		</layer>
		<layer id="65" name="Subtract_10218" type="Subtract" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="I32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="I32" />
			</input>
			<output>
				<port id="2" precision="I32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="Subtract_10219" type="Const" version="opset1">
			<data element_type="i32" shape="64, 32, 1, 1" offset="2608" size="8192" />
			<output>
				<port id="0" precision="I32">
					<dim>64</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="/patch_embed/seq/seq.2/c/Conv_quant" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="I32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="I32">
					<dim>64</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I32" names="/patch_embed/seq/seq.2/c/Conv_output_0_output_quantized">
					<dim>1</dim>
					<dim>64</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="/patch_embed/seq/seq.2/c/Conv_output_0_output_quantized_cast" type="Convert" version="opset1">
			<data destination_type="f32" />
			<input>
				<port id="0" precision="I32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/patch_embed/seq/seq.2/c/Conv_output_0_output_quantized_cast_output">
					<dim>1</dim>
					<dim>64</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="onnx::Conv_2451_scale" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="10800" size="4" />
			<output>
				<port id="0" precision="FP32" names="onnx::Conv_2451_scale" />
			</output>
		</layer>
		<layer id="70" name="/patch_embed/seq/seq.2/c/Conv_quant_scales_mul" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32" />
				<port id="1" precision="FP32" />
			</input>
			<output>
				<port id="2" precision="FP32" names="/patch_embed/seq/seq.2/c/Conv_quant_scales_mul:0" />
			</output>
		</layer>
		<layer id="71" name="/patch_embed/seq/seq.2/c/Conv_quant_output_scale_mul" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="FP32" />
			</input>
			<output>
				<port id="2" precision="FP32" names="/patch_embed/seq/seq.2/c/Conv_output_0quant_scaled_output">
					<dim>1</dim>
					<dim>64</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="72" name="/patch_embed/seq/seq.2/c/Conv_output_0_bias_reshape_output" type="Const" version="opset1">
			<data element_type="f32" shape="1, 64, 1, 1" offset="10804" size="256" />
			<output>
				<port id="0" precision="FP32" names="/patch_embed/seq/seq.2/c/Conv_output_0_bias_reshape_output">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="/patch_embed/seq/seq.2/c/Conv_output_0_bias_add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/patch_embed/seq/seq.2/c/Conv_output_0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="Constant_31212" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1, 1" offset="2048" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="Multiply_10256" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="Constant_10236" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="2052" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="77" name="Range_10232" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="2056" size="32" />
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="78" name="ReduceMax_10234" type="ReduceMax" version="opset1">
			<data keep_dims="false" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" />
			</output>
		</layer>
		<layer id="79" name="Maximum_10237" type="Maximum" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32" />
				<port id="1" precision="FP32" />
			</input>
			<output>
				<port id="2" precision="FP32" />
			</output>
		</layer>
		<layer id="80" name="Constant_10247" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="2052" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="81" name="ReduceMin_10245" type="ReduceMin" version="opset1">
			<data keep_dims="false" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" />
			</output>
		</layer>
		<layer id="82" name="Minimum_10248" type="Minimum" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32" />
				<port id="1" precision="FP32" />
			</input>
			<output>
				<port id="2" precision="FP32" />
			</output>
		</layer>
		<layer id="83" name="Subtract_10249" type="Subtract" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32" />
				<port id="1" precision="FP32" />
			</input>
			<output>
				<port id="2" precision="FP32" />
			</output>
		</layer>
		<layer id="84" name="Divide_10257" type="Divide" version="opset1">
			<data auto_broadcast="numpy" m_pythondiv="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="FP32" />
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="85" name="Round_10258" type="Round" version="opset5">
			<data mode="half_to_even" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="86" name="Constant_10224" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="2052" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="87" name="Subtract_10251" type="Subtract" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32" />
				<port id="1" precision="FP32" />
			</input>
			<output>
				<port id="2" precision="FP32" />
			</output>
		</layer>
		<layer id="88" name="Constant_17279" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="2088" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="89" name="/patch_embed/seq/seq.2/c/Conv_output_0_QuantizeLinear_/patch_embed/seq/seq.2/c/Conv_output_0_scale" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32" />
				<port id="1" precision="FP32" />
			</input>
			<output>
				<port id="2" precision="FP32" names="/patch_embed/seq/seq.2/c/Conv_output_0_scale" />
			</output>
		</layer>
		<layer id="90" name="Divide_10252" type="Divide" version="opset1">
			<data auto_broadcast="numpy" m_pythondiv="true" />
			<input>
				<port id="0" precision="FP32" />
				<port id="1" precision="FP32" />
			</input>
			<output>
				<port id="2" precision="FP32" />
			</output>
		</layer>
		<layer id="91" name="Round_10253" type="Round" version="opset5">
			<data mode="half_to_even" />
			<input>
				<port id="0" precision="FP32" />
			</input>
			<output>
				<port id="1" precision="FP32" />
			</output>
		</layer>
		<layer id="92" name="Clamp_10254" type="Clamp" version="opset1">
			<data min="0" max="255" />
			<input>
				<port id="0" precision="FP32" />
			</input>
			<output>
				<port id="1" precision="FP32" />
			</output>
		</layer>
		<layer id="93" name="/patch_embed/seq/seq.2/c/Conv_output_0_QuantizeLinear_/patch_embed/seq/seq.2/c/Conv_output_0_zero_point" type="Convert" version="opset1">
			<data destination_type="u8" />
			<input>
				<port id="0" precision="FP32" />
			</input>
			<output>
				<port id="1" precision="U8" names="/patch_embed/seq/seq.2/c/Conv_output_0_zero_point" />
			</output>
		</layer>
		<layer id="94" name="Convert_10259" type="Convert" version="opset1">
			<data destination_type="f32" />
			<input>
				<port id="0" precision="U8" />
			</input>
			<output>
				<port id="1" precision="FP32" />
			</output>
		</layer>
		<layer id="95" name="Add_10260" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="FP32" />
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="96" name="Clamp_10261" type="Clamp" version="opset1">
			<data min="0" max="255" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="97" name="/patch_embed/seq/seq.2/c/Conv_output_0_QuantizeLinear_/patch_embed/seq/seq.2/c/Conv_output_0_quantized" type="Convert" version="opset1">
			<data destination_type="u8" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="U8" names="/patch_embed/seq/seq.2/c/Conv_output_0_quantized">
					<dim>1</dim>
					<dim>64</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="98" name="Convert_10264" type="Convert" version="opset1">
			<data destination_type="i32" />
			<input>
				<port id="0" precision="U8">
					<dim>1</dim>
					<dim>64</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="99" name="Convert_10266" type="Convert" version="opset1">
			<data destination_type="i32" />
			<input>
				<port id="0" precision="U8" />
			</input>
			<output>
				<port id="1" precision="I32" />
			</output>
		</layer>
		<layer id="100" name="Subtract_10268" type="Subtract" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="I32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="I32" />
			</input>
			<output>
				<port id="2" precision="I32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="101" name="Subtract_10269" type="Const" version="opset1">
			<data element_type="i32" shape="256, 64, 1, 1" offset="11060" size="65536" />
			<output>
				<port id="0" precision="I32">
					<dim>256</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="102" name="/layers.0/blocks.0/conv1/c/Conv_quant" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="I32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="I32">
					<dim>256</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I32" names="/layers.0/blocks.0/conv1/c/Conv_output_0_output_quantized">
					<dim>1</dim>
					<dim>256</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="103" name="/layers.0/blocks.0/conv1/c/Conv_output_0_output_quantized_cast" type="Convert" version="opset1">
			<data destination_type="f32" />
			<input>
				<port id="0" precision="I32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/layers.0/blocks.0/conv1/c/Conv_output_0_output_quantized_cast_output">
					<dim>1</dim>
					<dim>256</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="104" name="onnx::Conv_2454_scale" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="76596" size="4" />
			<output>
				<port id="0" precision="FP32" names="onnx::Conv_2454_scale" />
			</output>
		</layer>
		<layer id="105" name="/layers.0/blocks.0/conv1/c/Conv_quant_scales_mul" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32" />
				<port id="1" precision="FP32" />
			</input>
			<output>
				<port id="2" precision="FP32" names="/layers.0/blocks.0/conv1/c/Conv_quant_scales_mul:0" />
			</output>
		</layer>
		<layer id="106" name="/layers.0/blocks.0/conv1/c/Conv_quant_output_scale_mul" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="FP32" />
			</input>
			<output>
				<port id="2" precision="FP32" names="/layers.0/blocks.0/conv1/c/Conv_output_0quant_scaled_output">
					<dim>1</dim>
					<dim>256</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="107" name="/layers.0/blocks.0/conv1/c/Conv_output_0_bias_reshape_output" type="Const" version="opset1">
			<data element_type="f32" shape="1, 256, 1, 1" offset="76600" size="1024" />
			<output>
				<port id="0" precision="FP32" names="/layers.0/blocks.0/conv1/c/Conv_output_0_bias_reshape_output">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="108" name="/layers.0/blocks.0/conv1/c/Conv_output_0_bias_add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/layers.0/blocks.0/conv1/c/Conv_output_0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="109" name="/layers.0/blocks.0/act1/Mul_1" type="Gelu" version="opset7">
			<data approximation_mode="ERF" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/layers.0/blocks.0/act1/Mul_1_output_0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="110" name="Constant_31213" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1, 1" offset="2048" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="111" name="Multiply_10311" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="112" name="Constant_10291" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="2052" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="113" name="Range_10287" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="2056" size="32" />
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="114" name="ReduceMax_10289" type="ReduceMax" version="opset1">
			<data keep_dims="false" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" />
			</output>
		</layer>
		<layer id="115" name="Maximum_10292" type="Maximum" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32" />
				<port id="1" precision="FP32" />
			</input>
			<output>
				<port id="2" precision="FP32" />
			</output>
		</layer>
		<layer id="116" name="Constant_10302" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="2052" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="117" name="ReduceMin_10300" type="ReduceMin" version="opset1">
			<data keep_dims="false" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" />
			</output>
		</layer>
		<layer id="118" name="Minimum_10303" type="Minimum" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32" />
				<port id="1" precision="FP32" />
			</input>
			<output>
				<port id="2" precision="FP32" />
			</output>
		</layer>
		<layer id="119" name="Subtract_10304" type="Subtract" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32" />
				<port id="1" precision="FP32" />
			</input>
			<output>
				<port id="2" precision="FP32" />
			</output>
		</layer>
		<layer id="120" name="Divide_10312" type="Divide" version="opset1">
			<data auto_broadcast="numpy" m_pythondiv="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="FP32" />
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="121" name="Round_10313" type="Round" version="opset5">
			<data mode="half_to_even" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="122" name="Constant_10279" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="2052" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="123" name="Subtract_10306" type="Subtract" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32" />
				<port id="1" precision="FP32" />
			</input>
			<output>
				<port id="2" precision="FP32" />
			</output>
		</layer>
		<layer id="124" name="Constant_17287" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="2088" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="125" name="/layers.0/blocks.0/act1/Mul_1_output_0_QuantizeLinear_/layers.0/blocks.0/act1/Mul_1_output_0_scale" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32" />
				<port id="1" precision="FP32" />
			</input>
			<output>
				<port id="2" precision="FP32" names="/layers.0/blocks.0/act1/Mul_1_output_0_scale" />
			</output>
		</layer>
		<layer id="126" name="Divide_10307" type="Divide" version="opset1">
			<data auto_broadcast="numpy" m_pythondiv="true" />
			<input>
				<port id="0" precision="FP32" />
				<port id="1" precision="FP32" />
			</input>
			<output>
				<port id="2" precision="FP32" />
			</output>
		</layer>
		<layer id="127" name="Round_10308" type="Round" version="opset5">
			<data mode="half_to_even" />
			<input>
				<port id="0" precision="FP32" />
			</input>
			<output>
				<port id="1" precision="FP32" />
			</output>
		</layer>
		<layer id="128" name="Clamp_10309" type="Clamp" version="opset1">
			<data min="0" max="255" />
			<input>
				<port id="0" precision="FP32" />
			</input>
			<output>
				<port id="1" precision="FP32" />
			</output>
		</layer>
		<layer id="129" name="/layers.0/blocks.0/act1/Mul_1_output_0_QuantizeLinear_/layers.0/blocks.0/act1/Mul_1_output_0_zero_point" type="Convert" version="opset1">
			<data destination_type="u8" />
			<input>
				<port id="0" precision="FP32" />
			</input>
			<output>
				<port id="1" precision="U8" names="/layers.0/blocks.0/act1/Mul_1_output_0_zero_point" />
			</output>
		</layer>
		<layer id="130" name="Convert_10314" type="Convert" version="opset1">
			<data destination_type="f32" />
			<input>
				<port id="0" precision="U8" />
			</input>
			<output>
				<port id="1" precision="FP32" />
			</output>
		</layer>
		<layer id="131" name="Add_10315" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="FP32" />
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="132" name="Clamp_10316" type="Clamp" version="opset1">
			<data min="0" max="255" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="133" name="/layers.0/blocks.0/act1/Mul_1_output_0_QuantizeLinear_/layers.0/blocks.0/act1/Mul_1_output_0_quantized" type="Convert" version="opset1">
			<data destination_type="u8" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="U8" names="/layers.0/blocks.0/act1/Mul_1_output_0_quantized">
					<dim>1</dim>
					<dim>256</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="134" name="Convert_10319" type="Convert" version="opset1">
			<data destination_type="i32" />
			<input>
				<port id="0" precision="U8">
					<dim>1</dim>
					<dim>256</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="135" name="Convert_10321" type="Convert" version="opset1">
			<data destination_type="i32" />
			<input>
				<port id="0" precision="U8" />
			</input>
			<output>
				<port id="1" precision="I32" />
			</output>
		</layer>
		<layer id="136" name="Subtract_10323" type="Subtract" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="I32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="I32" />
			</input>
			<output>
				<port id="2" precision="I32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="137" name="Reshape_10332" type="Const" version="opset1">
			<data element_type="i32" shape="256, 1, 1, 3, 3" offset="77624" size="9216" />
			<output>
				<port id="0" precision="I32">
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="138" name="/layers.0/blocks.0/conv2/c/Conv_quant" type="GroupConvolution" version="opset1">
			<data strides="1, 1" pads_begin="1, 1" pads_end="1, 1" dilations="1, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="I32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="I32">
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I32" names="/layers.0/blocks.0/conv2/c/Conv_output_0_output_quantized">
					<dim>1</dim>
					<dim>256</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="139" name="/layers.0/blocks.0/conv2/c/Conv_output_0_output_quantized_cast" type="Convert" version="opset1">
			<data destination_type="f32" />
			<input>
				<port id="0" precision="I32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
